const Map<String, String> gurbaniText = {
  "Japji Sahib / ਜਪੁਜੀ ਸਾਹਿਬ": """
  
ੴ ਸਤਿ ਨਾਮੁ ਕਰਤਾ ਪੁਰਖੁ ਨਿਰਭਉ ਨਿਰਵੈਰੁ
ਅਕਾਲ ਮੂਰਤਿ ਅਜੂਨੀ ਸੈਭੰ ਗੁਰ ਪ੍ਰਸਾਦਿ ॥

॥ ਜਪੁ ॥

ਆਦਿ ਸਚੁ ਜੁਗਾਦਿ ਸਚੁ ॥
ਹੈ ਭੀ ਸਚੁ ਨਾਨਕ ਹੋਸੀ ਭੀ ਸਚੁ ॥੧॥

ਸੋਚੈ ਸੋਚਿ ਨ ਹੋਵਈ ਜੇ ਸੋਚੀ ਲਖ ਵਾਰ ॥
ਚੁਪੈ ਚੁਪ ਨ ਹੋਵਈ ਜੇ ਲਾਇ ਰਹਾ ਲਿਵ ਤਾਰ ॥
ਭੁਖਿਆ ਭੁਖ ਨ ਉਤਰੀ ਜੇ ਬੰਨਾ ਪੁਰੀਆ ਭਾਰ ॥
ਸਹਸ ਸਿਆਣਪਾ ਲਖ ਹੋਹਿ ਤ ਇਕ ਨ ਚਲੈ ਨਾਲਿ ॥
ਕਿਵ ਸਚਿਆਰਾ ਹੋਈਐ ਕਿਵ ਕੂੜੈ ਤੁਟੈ ਪਾਲਿ ॥
ਹੁਕਮਿ ਰਜਾਈ ਚਲਣਾ ਨਾਨਕ ਲਿਖਿਆ ਨਾਲਿ ॥੧॥

ਹੁਕਮੀ ਹੋਵਨਿ ਆਕਾਰ ਹੁਕਮੁ ਨ ਕਹਿਆ ਜਾਈ ॥
ਹੁਕਮੀ ਹੋਵਨਿ ਜੀਅ ਹੁਕਮਿ ਮਿਲੈ ਵਡਿਆਈ ॥
ਹੁਕਮੀ ਉਤਮੁ ਨੀਚੁ ਹੁਕਮਿ ਲਿਖਿ ਦੁਖ ਸੁਖ ਪਾਈਅਹਿ ॥
ਇਕਨਾ ਹੁਕਮੀ ਬਖਸੀਸ ਇਕਿ ਹੁਕਮੀ ਸਦਾ ਭਵਾਈਅਹਿ ॥
ਹੁਕਮੈ ਅੰਦਰਿ ਸਭੁ ਕੋ ਬਾਹਰਿ ਹੁਕਮ ਨ ਕੋਇ ॥
ਨਾਨਕ ਹੁਕਮੈ ਜੇ ਬੁਝੈ ਤ ਹਉਮੈ ਕਹੈ ਨ ਕੋਇ ॥੨॥

ਗਾਵੈ ਕੋ ਤਾਣੁ ਹੋਵੈ ਕਿਸੈ ਤਾਣੁ ॥
ਗਾਵੈ ਕੋ ਦਾਤਿ ਜਾਣੈ ਨੀਸਾਣੁ ॥
ਗਾਵੈ ਕੋ ਗੁਣ ਵਡਿਆਈਆ ਚਾਰ ॥
ਗਾਵੈ ਕੋ ਵਿਦਿਆ ਵਿਖਮੁ ਵੀਚਾਰੁ ॥
ਗਾਵੈ ਕੋ ਸਾਜਿ ਕਰੇ ਤਨੁ ਖੇਹ ॥
ਗਾਵੈ ਕੋ ਜੀਅ ਲੈ ਫਿਰਿ ਦੇਹ॥
ਗਾਵੈ ਕੋ ਜਾਪੈ ਦਿਸੈ ਦੂਰਿ ॥
ਗਾਵੈ ਕੋ ਵੇਖੈ ਹਾਦਰਾ ਹਦੂਰਿ ॥
ਕਥਨਾ ਕਥੀ ਨ ਆਵੈ ਤੋਟਿ ॥
ਕਥਿ ਕਥਿ ਕਥੀ ਕੋਟੀ ਕੋਟਿ ਕੋਟਿ ॥
ਦੇਦਾ ਦੇ ਲੈਦੇ ਥਕਿ ਪਾਹਿ॥
ਜੁਗਾ ਜੁਗੰਤਰਿ ਖਾਹੀ ਖਾਹਿ ॥
ਹੁਕਮੀ ਹੁਕਮੁ ਚਲਾਏ ਰਾਹੁ ॥
ਨਾਨਕ ਵਿਗਸੈ ਵੇਪਰਵਾਹੁ ॥੩॥

ਸਾਚਾ ਸਾਹਿਬੁ ਸਾਚੁ ਨਾਇ ਭਾਖਿਆ ਭਾਉ ਅਪਾਰੁ ॥
ਆਖਹਿ ਮੰਗਹਿ ਦੇਹਿ ਦੇਹਿ ਦਾਤਿ ਕਰੇ ਦਾਤਾਰੁ ॥
ਫੇਰਿ ਕਿ ਅਗੈ ਰਖੀਐ ਜਿਤੁ ਦਿਸੈ ਦਰਬਾਰੁ ॥
ਮੁਹੌ ਕਿ ਬੋਲਣੁ ਬੋਲੀਐ ਜਿਤੁ ਸੁਣਿ ਧਰੇ ਪਿਆਰੁ ॥
ਅੰਮ੍ਰਿਤ ਵੇਲਾ ਸਚੁ ਨਾਉ ਵਡਿਆਈ ਵੀਚਾਰੁ ॥
ਕਰਮੀ ਆਵੈ ਕਪੜਾ ਨਦਰੀ ਮੋਖੁ ਦੁਆਰੁ ॥
ਨਾਨਕ ਏਵੈ ਜਾਣੀਐ ਸਭੁ ਆਪੇ ਸਚਿਆਰੁ ॥੪॥

ਥਾਪਿਆ ਨ ਜਾਇ ਕੀਤਾ ਨ ਹੋਇ ॥
ਆਪੇ ਆਪਿ ਨਿਰੰਜਨੁ ਸੋਇ ॥
ਜਿਨਿ ਸੇਵਿਆ ਤਿਨਿ ਪਾਇਆ ਮਾਨੁ ॥
ਨਾਨਕ ਗਾਵੀਐ ਗੁਣੀ ਨਿਧਾਨੁ ॥
ਗਾਵੀਐ ਸੁਣੀਐ ਮਨਿ ਰਖੀਐ ਭਾਉ ॥
ਦੁਖੁ ਪਰਹਰਿ ਸੁਖੁ ਘਰਿ ਲੈ ਜਾਇ ॥
ਗੁਰਮੁਖਿ ਨਾਦੰ ਗੁਰਮੁਖਿ ਵੇਦੰ ਗੁਰਮੁਖਿ ਰਹਿਆ ਸਮਾਈ ॥
ਗੁਰੁ ਈਸਰੁ ਗੁਰੁ ਗੋਰਖੁ ਬਰਮਾ ਗੁਰੁ ਪਾਰਬਤੀ ਮਾਈ ॥
ਜੇ ਹਉ ਜਾਣਾ ਆਖਾ ਨਾਹੀ ਕਹਣਾ ਕਥਨੁ ਨ ਜਾਈ ॥
ਗੁਰਾ ਇਕ ਦੇਹਿ ਬੁਝਾਈ ॥
ਸਭਨਾ ਜੀਆ ਕਾ ਇਕੁ ਦਾਤਾ ਸੋ ਮੈ ਵਿਸਰਿ ਨ ਜਾਈ ॥੫॥

ਤੀਰਥਿ ਨਾਵਾ ਜੇ ਤਿਸੁ ਭਾਵਾ ਵਿਣੁ ਭਾਣੇ ਕਿ ਨਾਇ ਕਰੀ ॥
ਜੇਤੀ ਸਿਰਠਿ ਉਪਾਈ ਵੇਖਾ ਵਿਣੁ ਕਰਮਾ ਕਿ ਮਿਲੈ ਲਈ ॥
ਮਤਿ ਵਿਚਿ ਰਤਨ ਜਵਾਹਰ ਮਾਣਿਕ ਜੇ ਇਕ ਗੁਰ ਕੀ ਸਿਖ ਸੁਣੀ ॥
ਗੁਰਾ ਇਕ ਦੇਹਿ ਬੁਝਾਈ ॥
ਸਭਨਾ ਜੀਆ ਕਾ ਇਕੁ ਦਾਤਾ ਸੋ ਮੈ ਵਿਸਰਿ ਨ ਜਾਈ ॥੬॥

ਜੇ ਜੁਗ ਚਾਰੇ ਆਰਜਾ ਹੋਰ ਦਸੂਣੀ ਹੋਇ ॥
ਨਵਾ ਖੰਡਾ ਵਿਚਿ ਜਾਣੀਐ ਨਾਲਿ ਚਲੈ ਸਭੁ ਕੋਇ ॥
ਚੰਗਾ ਨਾਉ ਰਖਾਇ ਕੈ ਜਸੁ ਕੀਰਤਿ ਜਗਿ ਲੇਇ ॥
ਜੇ ਤਿਸੁ ਨਦਰਿ ਨ ਆਵਈ ਤ ਵਾਤ ਨ ਪੁਛੈ ਕੇ ॥
ਕੀਟਾ ਅੰਦਰਿ ਕੀਟੁ ਕਰਿ ਦੋਸੀ ਦੋਸੁ ਧਰੇ ॥
ਨਾਨਕ ਨਿਰਗੁਣਿ ਗੁਣੁ ਕਰੇ ਗੁਣਵੰਤਿਆ ਗੁਣੁ ਦੇ ॥
ਤੇਹਾ ਕੋਇ ਨ ਸੁਝਈ ਜਿ ਤਿਸੁ ਗੁਣੁ ਕੋਇ ਕਰੇ ॥੭॥

ਸੁਣਿਐ ਸਿਧ ਪੀਰ ਸੁਰਿ ਨਾਥ ॥
ਸੁਣਿਐ ਧਰਤਿ ਧਵਲ ਆਕਾਸ ॥
ਸੁਣਿਐ ਦੀਪ ਲੋਅ ਪਾਤਾਲ ॥
ਸੁਣਿਐ ਪੋਹਿ ਨ ਸਕੈ ਕਾਲੁ ॥
ਨਾਨਕ ਭਗਤਾ ਸਦਾ ਵਿਗਾਸੁ ॥
ਸੁਣਿਐ ਦੂਖ ਪਾਪ ਕਾ ਨਾਸੁ ॥੮॥

ਸੁਣਿਐ ਈਸਰੁ ਬਰਮਾ ਇੰਦੁ ॥
ਸੁਣਿਐ ਮੁਖਿ ਸਾਲਾਹਣ ਮੰਦੁ ॥
ਸੁਣਿਐ ਜੋਗ ਜੁਗਤਿ ਤਨਿ ਭੇਦ ॥
ਸੁਣਿਐ ਸਾਸਤ ਸਿਮ੍ਰਿਤਿ ਵੇਦ ॥
ਨਾਨਕ ਭਗਤਾ ਸਦਾ ਵਿਗਾਸੁ ॥
ਸੁਣਿਐ ਦੂਖ ਪਾਪ ਕਾ ਨਾਸੁ ॥੯॥

ਸੁਣਿਐ ਸਤੁ ਸੰਤੋਖੁ ਗਿਆਨੁ ॥
ਸੁਣਿਐ ਅਠਸਠਿ ਕਾ ਇਸਨਾਨੁ ॥
ਸੁਣਿਐ ਪੜਿ ਪੜਿ ਪਾਵਹਿ ਮਾਨੁ ॥
ਸੁਣਿਐ ਲਾਗੈ ਸਹਜਿ ਧਿਆਨੁ ॥
ਨਾਨਕ ਭਗਤਾ ਸਦਾ ਵਿਗਾਸੁ ॥
ਸੁਣਿਐ ਦੂਖ ਪਾਪ ਕਾ ਨਾਸੁ ॥੧੦॥

ਸੁਣਿਐ ਸਰਾ ਗੁਣਾ ਕੇ ਗਾਹ ॥
ਸੁਣਿਐ ਸੇਖ ਪੀਰ ਪਾਤਿਸਾਹ ॥
ਸੁਣਿਐ ਅੰਧੇ ਪਾਵਹਿ ਰਾਹੁ ॥
ਸੁਣਿਐ ਹਾਥ ਹੋਵੈ ਅਸਗਾਹੁ ॥
ਨਾਨਕ ਭਗਤਾ ਸਦਾ ਵਿਗਾਸੁ ॥
ਸੁਣਿਐ ਦੂਖ ਪਾਪ ਕਾ ਨਾਸੁ ॥੧੧॥

ਮੰਨੇ ਕੀ ਗਤਿ ਕਹੀ ਨ ਜਾਇ ॥
ਜੇ ਕੋ ਕਹੈ ਪਿਛੈ ਪਛੁਤਾਇ ॥
ਕਾਗਦਿ ਕਲਮ ਨ ਲਿਖਣਹਾਰੁ ॥
ਮੰਨੇ ਕਾ ਬਹਿ ਕਰਨਿ ਵੀਚਾਰੁ ॥
ਐਸਾ ਨਾਮੁ ਨਿਰੰਜਨੁ ਹੋਇ ॥
ਜੇ ਕੋ ਮੰਨਿ ਜਾਣੈ ਮਨਿ ਕੋਇ ॥੧੨॥

ਮੰਨੈ ਸੁਰਤਿ ਹੋਵੈ ਮਨਿ ਬੁਧਿ ॥
ਮੰਨੈ ਸਗਲ ਭਵਣ ਕੀ ਸੁਧਿ ॥
ਮੰਨੈ ਮੁਹਿ ਚੋਟਾ ਨਾ ਖਾਇ ॥
ਮੰਨੈ ਜਮ ਕੈ ਸਾਥਿ ਨ ਜਾਇ ॥
ਐਸਾ ਨਾਮੁ ਨਿਰੰਜਨੁ ਹੋਇ ॥
ਜੇ ਕੋ ਮੰਨਿ ਜਾਣੈ ਮਨਿ ਕੋਇ ॥੧੩॥

ਮੰਨੈ ਮਾਰਗਿ ਠਾਕ ਨ ਪਾਇ ॥
ਮੰਨੈ ਪਤਿ ਸਿਉ ਪਰਗਟੁ ਜਾਇ ॥
ਮੰਨੈ ਮਗੁ ਨ ਚਲੈ ਪੰਥੁ ॥
ਮੰਨੈ ਧਰਮ ਸੇਤੀ ਸਨਬੰਧੁ ॥
ਐਸਾ ਨਾਮੁ ਨਿਰੰਜਨੁ ਹੋਇ ॥
ਜੇ ਕੋ ਮੰਨਿ ਜਾਣੈ ਮਨਿ ਕੋਇ ॥੧੪॥

ਮੰਨੈ ਪਾਵਹਿ ਮੋਖੁ ਦੁਆਰੁ ॥
ਮੰਨੈ ਪਰਵਾਰੈ ਸਾਧਾਰੁ ॥
ਮੰਨੈ ਤਰੈ ਤਾਰੇ ਗੁਰੁ ਸਿਖ ॥
ਮੰਨੈ ਨਾਨਕ ਭਵਹਿ ਨ ਭਿਖ ॥
ਐਸਾ ਨਾਮੁ ਨਿਰੰਜਨੁ ਹੋਇ ॥
ਜੇ ਕੋ ਮੰਨਿ ਜਾਣੈ ਮਨਿ ਕੋਇ ॥੧੫॥

ਪੰਚ ਪਰਵਾਣ ਪੰਚ ਪਰਧਾਨੁ ॥
ਪੰਚੇ ਪਾਵਹਿ ਦਰਗਹਿ ਮਾਨੁ ॥
ਪੰਚੇ ਸੋਹਹਿ ਦਰਿ ਰਾਜਾਨੁ ॥
ਪੰਚਾ ਕਾ ਗੁਰੁ ਏਕੁ ਧਿਆਨੁ ॥
ਜੇ ਕੋ ਕਹੈ ਕਰੈ ਵੀਚਾਰੁ ॥
ਕਰਤੇ ਕੈ ਕਰਣੈ ਨਾਹੀ ਸੁਮਾਰੁ ॥
ਧੌਲੁ ਧਰਮੁ ਦਇਆ ਕਾ ਪੂਤੁ ॥
ਸੰਤੋਖੁ ਥਾਪਿ ਰਖਿਆ ਜਿਨਿ ਸੂਤਿ ॥
ਜੇ ਕੋ ਬੁਝੈ ਹੋਵੈ ਸਚਿਆਰੁ ॥
ਧਵਲੈ ਉਪਰਿ ਕੇਤਾ ਭਾਰੁ ॥
ਧਰਤੀ ਹੋਰੁ ਪਰੈ ਹੋਰੁ ਹੋਰੁ ॥
ਤਿਸ ਤੇ ਭਾਰੁ ਤਲੈ ਕਵਣੁ ਜੋਰੁ ॥
ਜੀਅ ਜਾਤਿ ਰੰਗਾ ਕੇ ਨਾਵ ॥
ਸਭਨਾ ਲਿਖਿਆ ਵੁੜੀ ਕਲਾਮ ॥
ਏਹੁ ਲੇਖਾ ਲਿਖਿ ਜਾਣੈ ਕੋਇ ॥
ਲੇਖਾ ਲਿਖਿਆ ਕੇਤਾ ਹੋਇ ॥
ਕੇਤਾ ਤਾਣੁ ਸੁਆਲਿਹੁ ਰੂਪੁ ॥
ਕੇਤੀ ਦਾਤਿ ਜਾਣੈ ਕੌਣੁ ਕੂਤੁ ॥
ਕੀਤਾ ਪਸਾਉ ਏਕੋ ਕਵਾਉ ॥
ਤਿਸ ਤੇ ਹੋਏ ਲਖ ਦਰੀਆਉ ॥
ਕੁਦਰਤਿ ਕਵਣ ਕਹਾ ਵੀਚਾਰੁ ॥
ਵਾਰਿਆ ਨ ਜਾਵਾ ਏਕ ਵਾਰ ॥
ਜੋ ਤੁਧੁ ਭਾਵੈ ਸਾਈ ਭਲੀ ਕਾਰ ॥
ਤੂ ਸਦਾ ਸਲਾਮਤਿ ਨਿਰੰਕਾਰ ॥੧੬॥

ਅਸੰਖ ਜਪ ਅਸੰਖ ਭਾਉ ॥
ਅਸੰਖ ਪੂਜਾ ਅਸੰਖ ਤਪ ਤਾਉ ॥
ਅਸੰਖ ਗਰੰਥ ਮੁਖਿ ਵੇਦ ਪਾਠ ॥
ਅਸੰਖ ਜੋਗ ਮਨਿ ਰਹਹਿ ਉਦਾਸ ॥
ਅਸੰਖ ਭਗਤ ਗੁਣ ਗਿਆਨ ਵੀਚਾਰ ॥
ਅਸੰਖ ਸਤੀ ਅਸੰਖ ਦਾਤਾਰ ॥
ਅਸੰਖ ਸੂਰ ਮੁਹ ਭਖ ਸਾਰ ॥
ਅਸੰਖ ਮੋਨਿ ਲਿਵ ਲਾਇ ਤਾਰ ॥
ਕੁਦਰਤਿ ਕਵਣ ਕਹਾ ਵੀਚਾਰੁ ॥
ਵਾਰਿਆ ਨ ਜਾਵਾ ਏਕ ਵਾਰ ॥
ਜੋ ਤੁਧੁ ਭਾਵੈ ਸਾਈ ਭਲੀ ਕਾਰ ॥
ਤੂ ਸਦਾ ਸਲਾਮਤਿ ਨਿਰੰਕਾਰ ॥੧੭॥

ਅਸੰਖ ਮੂਰਖ ਅੰਧ ਘੋਰ ॥
ਅਸੰਖ ਚੋਰ ਹਰਾਮਖੋਰ ॥
ਅਸੰਖ ਅਮਰ ਕਰਿ ਜਾਹਿ ਜੋਰ ॥
ਅਸੰਖ ਗਲਵਢ ਹਤਿਆ ਕਮਾਹਿ ॥
ਅਸੰਖ ਪਾਪੀ ਪਾਪੁ ਕਰਿ ਜਾਹਿ ॥
ਅਸੰਖ ਕੂੜਿਆਰ ਕੂੜੇ ਫਿਰਾਹਿ ॥
ਅਸੰਖ ਮਲੇਛ ਮਲੁ ਭਖਿ ਖਾਹਿ ॥
ਅਸੰਖ ਨਿੰਦਕ ਸਿਰਿ ਕਰਹਿ ਭਾਰੁ ॥
ਨਾਨਕੁ ਨੀਚੁ ਕਹੈ ਵੀਚਾਰੁ ॥
ਵਾਰਿਆ ਨ ਜਾਵਾ ਏਕ ਵਾਰ ॥
ਜੋ ਤੁਧੁ ਭਾਵੈ ਸਾਈ ਭਲੀ ਕਾਰ ॥
ਤੂ ਸਦਾ ਸਲਾਮਤਿ ਨਿਰੰਕਾਰ ॥੧੮॥

ਅਸੰਖ ਨਾਵ ਅਸੰਖ ਥਾਵ ॥
ਅਗੰਮ ਅਗੰਮ ਅਸੰਖ ਲੋਅ ॥
ਅਸੰਖ ਕਹਹਿ ਸਿਰਿ ਭਾਰੁ ਹੋਇ ॥
ਅਖਰੀ ਨਾਮੁ ਅਖਰੀ ਸਾਲਾਹ ॥
ਅਖਰੀ ਗਿਆਨੁ ਗੀਤ ਗੁਣ ਗਾਹ ॥
ਅਖਰੀ ਲਿਖਣੁ ਬੋਲਣੁ ਬਾਣਿ ॥
ਅਖਰਾ ਸਿਰਿ ਸੰਜੋਗੁ ਵਖਾਣਿ ॥
ਜਿਨਿ ਏਹਿ ਲਿਖੇ ਤਿਸੁ ਸਿਰਿ ਨਾਹਿ ॥
ਜਿਵ ਫੁਰਮਾਏ ਤਿਵ ਤਿਵ ਪਾਹਿ ॥
ਜੇਤਾ ਕੀਤਾ ਤੇਤਾ ਨਾਉ ॥
ਵਿਣੁ ਨਾਵੈ ਨਾਹੀ ਕੋ ਥਾਉ ॥
ਕੁਦਰਤਿ ਕਵਣ ਕਹਾ ਵੀਚਾਰੁ ॥
ਵਾਰਿਆ ਨ ਜਾਵਾ ਏਕ ਵਾਰ ॥
ਜੋ ਤੁਧੁ ਭਾਵੈ ਸਾਈ ਭਲੀ ਕਾਰ ॥
ਤੂ ਸਦਾ ਸਲਾਮਤਿ ਨਿਰੰਕਾਰ ॥੧੯॥

ਭਰੀਐ ਹਥੁ ਪੈਰੁ ਤਨੁ ਦੇਹ ॥
ਪਾਣੀ ਧੋਤੈ ਉਤਰਸੁ ਖੇਹ ॥
ਮੂਤ ਪਲੀਤੀ ਕਪੜੁ ਹੋਇ ॥
ਦੇ ਸਾਬੂਣੁ ਲਈਐ ਓਹੁ ਧੋਇ ॥
ਭਰੀਐ ਮਤਿ ਪਾਪਾ ਕੈ ਸੰਗਿ ॥
ਓਹੁ ਧੋਪੈ ਨਾਵੈ ਕੈ ਰੰਗਿ ॥
ਪੁੰਨੀ ਪਾਪੀ ਆਖਣੁ ਨਾਹਿ ॥
ਕਰਿ ਕਰਿ ਕਰਣਾ ਲਿਖਿ ਲੈ ਜਾਹੁ ॥
ਆਪੇ ਬੀਜਿ ਆਪੇ ਹੀ ਖਾਹੁ ॥
ਨਾਨਕ ਹੁਕਮੀ ਆਵਹੁ ਜਾਹੁ ॥੨੦॥

ਤੀਰਥੁ ਤਪੁ ਦਇਆ ਦਤੁ ਦਾਨੁ ॥
ਜੇ ਕੋ ਪਾਵੈ ਤਿਲ ਕਾ ਮਾਨੁ ॥
ਸੁਣਿਆ ਮੰਨਿਆ ਮਨਿ ਕੀਤਾ ਭਾਉ ॥
ਅੰਤਰਗਤਿ ਤੀਰਥਿ ਮਲਿ ਨਾਉ ॥
ਸਭਿ ਗੁਣ ਤੇਰੇ ਮੈ ਨਾਹੀ ਕੋਇ ॥
ਵਿਣੁ ਗੁਣ ਕੀਤੇ ਭਗਤਿ ਨ ਹੋਇ ॥
ਸੁਅਸਤਿ ਆਥਿ ਬਾਣੀ ਬਰਮਾਉ ॥
ਸਤਿ ਸੁਹਾਣੁ ਸਦਾ ਮਨਿ ਚਾਉ ॥
ਕਵਣੁ ਸੁ ਵੇਲਾ ਵਖਤੁ ਕਵਣੁ ਕਵਣ ਥਿਤਿ ਕਵਣੁ ਵਾਰੁ ॥
ਕਵਣਿ ਸਿ ਰੁਤੀ ਮਾਹੁ ਕਵਣੁ ਜਿਤੁ ਹੋਆ ਆਕਾਰੁ ॥
ਵੇਲ ਨ ਪਾਈਆ ਪੰਡਤੀ ਜਿ ਹੋਵੈ ਲੇਖੁ ਪੁਰਾਣੁ ॥
ਵਖਤੁ ਨ ਪਾਇਓ ਕਾਦੀਆ ਜਿ ਲਿਖਨਿ ਲੇਖੁ ਕੁਰਾਣੁ ॥
ਥਿਤਿ ਵਾਰੁ ਨਾ ਜੋਗੀ ਜਾਣੈ ਰੁਤਿ ਮਾਹੁ ਨਾ ਕੋਈ ॥
ਜਾ ਕਰਤਾ ਸਿਰਠੀ ਕਉ ਸਾਜੇ ਆਪੇ ਜਾਣੈ ਸੋਈ ॥
ਕਿਵ ਕਰਿ ਆਖਾ ਕਿਵ ਸਾਲਾਹੀ ਕਿਉ ਵਰਨੀ ਕਿਵ ਜਾਣਾ ॥
ਨਾਨਕ ਆਖਣਿ ਸਭੁ ਕੋ ਆਖੈ ਇਕ ਦੂ ਇਕੁ ਸਿਆਣਾ ॥
ਵਡਾ ਸਾਹਿਬੁ ਵਡੀ ਨਾਈ ਕੀਤਾ ਜਾ ਕਾ ਹੋਵੈ ॥
ਨਾਨਕ ਜੇ ਕੋ ਆਪੌ ਜਾਣੈ ਅਗੈ ਗਇਆ ਨ ਸੋਹੈ ॥੨੧॥

ਪਾਤਾਲਾ ਪਾਤਾਲ ਲਖ ਆਗਾਸਾ ਆਗਾਸ ॥
ਓੜਕ ਓੜਕ ਭਾਲਿ ਥਕੇ ਵੇਦ ਕਹਨਿ ਇਕ ਵਾਤ ॥
ਸਹਸ ਅਠਾਰਹ ਕਹਨਿ ਕਤੇਬਾ ਅਸੁਲੂ ਇਕੁ ਧਾਤੁ ॥
ਲੇਖਾ ਹੋਇ ਤ ਲਿਖੀਐ ਲੇਖੈ ਹੋਇ ਵਿਣਾਸੁ ॥
ਨਾਨਕ ਵਡਾ ਆਖੀਐ ਆਪੇ ਜਾਣੈ ਆਪੁ ॥੨੨॥

ਸਾਲਾਹੀ ਸਾਲਾਹਿ ਏਤੀ ਸੁਰਤਿ ਨ ਪਾਈਆ ॥
ਨਦੀਆ ਅਤੈ ਵਾਹ ਪਵਹਿ ਸਮੁੰਦਿ ਨ ਜਾਣੀਅਹਿ ॥
ਸਮੁੰਦ ਸਾਹ ਸੁਲਤਾਨ ਗਿਰਹਾ ਸੇਤੀ ਮਾਲੁ ਧਨੁ ॥
ਕੀੜੀ ਤੁਲਿ ਨ ਹੋਵਨੀ ਜੇ ਤਿਸੁ ਮਨਹੁ ਨ ਵੀਸਰਹਿ ॥੨੩॥

ਅੰਤੁ ਨ ਸਿਫਤੀ ਕਹਣਿ ਨ ਅੰਤੁ ॥
ਅੰਤੁ ਨ ਕਰਣੈ ਦੇਣਿ ਨ ਅੰਤੁ ॥
ਅੰਤੁ ਨ ਵੇਖਣਿ ਸੁਣਣਿ ਨ ਅੰਤੁ ॥
ਅੰਤੁ ਨ ਜਾਪੈ ਕਿਆ ਮਨਿ ਮੰਤੁ ॥
ਅੰਤੁ ਨ ਜਾਪੈ ਕੀਤਾ ਆਕਾਰੁ ॥
ਅੰਤੁ ਨ ਜਾਪੈ ਪਾਰਾਵਾਰੁ ॥
ਅੰਤ ਕਾਰਣਿ ਕੇਤੇ ਬਿਲਲਾਹਿ ॥
ਤਾ ਕੇ ਅੰਤ ਨ ਪਾਏ ਜਾਹਿ ॥
ਏਹੁ ਅੰਤੁ ਨ ਜਾਣੈ ਕੋਇ ॥
ਬਹੁਤਾ ਕਹੀਐ ਬਹੁਤਾ ਹੋਇ ॥
ਵਡਾ ਸਾਹਿਬੁ ਊਚਾ ਥਾਉ ॥
ਊਚੇ ਉਪਰਿ ਊਚਾ ਨਾਉ ॥
ਏਵਡੁ ਊਚਾ ਹੋਵੈ ਕੋਇ ॥
ਤਿਸੁ ਊਚੇ ਕਉ ਜਾਣੈ ਸੋਇ ॥
ਜੇਵਡੁ ਆਪਿ ਜਾਣੈ ਆਪਿ ਆਪਿ ॥
ਨਾਨਕ ਨਦਰੀ ਕਰਮੀ ਦਾਤਿ ॥੨੪॥

ਬਹੁਤਾ ਕਰਮੁ ਲਿਖਿਆ ਨਾ ਜਾਇ ॥
ਵਡਾ ਦਾਤਾ ਤਿਲੁ ਨ ਤਮਾਇ ॥
ਕੇਤੇ ਮੰਗਹਿ ਜੋਧ ਅਪਾਰ ॥
ਕੇਤਿਆ ਗਣਤ ਨਹੀ ਵੀਚਾਰੁ ॥
ਕੇਤੇ ਖਪਿ ਤੁਟਹਿ ਵੇਕਾਰ ॥
ਕੇਤੇ ਲੈ ਲੈ ਮੁਕਰੁ ਪਾਹਿ ॥
ਕੇਤੇ ਮੂਰਖ ਖਾਹੀ ਖਾਹਿ ॥
ਕੇਤਿਆ ਦੂਖ ਭੂਖ ਸਦ ਮਾਰ ॥
ਏਹਿ ਭਿ ਦਾਤਿ ਤੇਰੀ ਦਾਤਾਰ ॥
ਬੰਦਿ ਖਲਾਸੀ ਭਾਣੈ ਹੋਇ ॥
ਹੋਰੁ ਆਖਿ ਨ ਸਕੈ ਕੋਇ ॥
ਜੇ ਕੋ ਖਾਇਕੁ ਆਖਣਿ ਪਾਇ ॥
ਓਹੁ ਜਾਣੈ ਜੇਤੀਆ ਮੁਹਿ ਖਾਇ ॥
ਆਪੇ ਜਾਣੈ ਆਪੇ ਦੇਇ ॥
ਆਖਹਿ ਸਿ ਭਿ ਕੇਈ ਕੇਇ ॥
ਜਿਸ ਨੋ ਬਖਸੇ ਸਿਫਤਿ ਸਾਲਾਹ ॥
ਨਾਨਕ ਪਾਤਿਸਾਹੀ ਪਾਤਿਸਾਹੁ ॥੨੫॥

ਅਮੁਲ ਗੁਣ ਅਮੁਲ ਵਾਪਾਰ ॥
ਅਮੁਲ ਵਾਪਾਰੀਏ ਅਮੁਲ ਭੰਡਾਰ ॥
ਅਮੁਲ ਆਵਹਿ ਅਮੁਲ ਲੈ ਜਾਹਿ ॥
ਅਮੁਲ ਭਾਇ ਅਮੁਲਾ ਸਮਾਹਿ ॥
ਅਮੁਲੁ ਧਰਮੁ ਅਮੁਲੁ ਦੀਬਾਣੁ ॥
ਅਮੁਲੁ ਤੁਲੁ ਅਮੁਲੁ ਪਰਵਾਣੁ ॥
ਅਮੁਲੁ ਬਖਸੀਸ ਅਮੁਲੁ ਨੀਸਾਣੁ ॥
ਅਮੁਲੁ ਕਰਮੁ ਅਮੁਲੁ ਫੁਰਮਾਣੁ ॥
ਅਮੁਲੋ ਅਮੁਲੁ ਆਖਿਆ ਨ ਜਾਇ ॥
ਆਖਿ ਆਖਿ ਰਹੇ ਲਿਵ ਲਾਇ ॥
ਆਖਹਿ ਵੇਦ ਪਾਠ ਪੁਰਾਣ ॥
ਆਖਹਿ ਪੜੇ ਕਰਹਿ ਵਖਿਆਣ ॥
ਆਖਹਿ ਬਰਮੇ ਆਖਹਿ ਇੰਦ ॥
ਆਖਹਿ ਗੋਪੀ ਤੈ ਗੋਵਿੰਦ ॥
ਆਖਹਿ ਈਸਰ ਆਖਹਿ ਸਿਧ ॥
ਆਖਹਿ ਕੇਤੇ ਕੀਤੇ ਬੁਧ ॥
ਆਖਹਿ ਦਾਨਵ ਆਖਹਿ ਦੇਵ ॥
ਆਖਹਿ ਸੁਰਿ ਨਰ ਮੁਨਿ ਜਨ ਸੇਵ ॥
ਕੇਤੇ ਆਖਹਿ ਆਖਣਿ ਪਾਹਿ ॥
ਕੇਤੇ ਕਹਿ ਕਹਿ ਉਠਿ ਉਠਿ ਜਾਹਿ ॥
ਏਤੇ ਕੀਤੇ ਹੋਰਿ ਕਰੇਹਿ ॥
ਤਾ ਆਖਿ ਨ ਸਕਹਿ ਕੇਈ ਕੇਇ ॥
ਜੇਵਡੁ ਭਾਵੈ ਤੇਵਡੁ ਹੋਇ ॥
ਨਾਨਕ ਜਾਣੈ ਸਾਚਾ ਸੋਇ ॥
ਜੇ ਕੋ ਆਖੈ ਬੋਲੁਵਿਗਾੜੁ ॥
ਤਾ ਲਿਖੀਐ ਸਿਰਿ ਗਾਵਾਰਾ ਗਾਵਾਰੁ ॥੨੬॥

ਸੋ ਦਰੁ ਕੇਹਾ ਸੋ ਘਰੁ ਕੇਹਾ ਜਿਤੁ ਬਹਿ ਸਰਬ ਸਮਾਲੇ ॥
ਵਾਜੇ ਨਾਦ ਅਨੇਕ ਅਸੰਖਾ ਕੇਤੇ ਵਾਵਣਹਾਰੇ ॥
ਕੇਤੇ ਰਾਗ ਪਰੀ ਸਿਉ ਕਹੀਅਨਿ ਕੇਤੇ ਗਾਵਣਹਾਰੇ ॥
ਗਾਵਹਿ ਤੁਹਨੋ ਪਉਣੁ ਪਾਣੀ ਬੈਸੰਤਰੁ ਗਾਵੈ ਰਾਜਾ ਧਰਮੁ ਦੁਆਰੇ ॥
ਗਾਵਹਿ ਚਿਤੁ ਗੁਪਤੁ ਲਿਖਿ ਜਾਣਹਿ ਲਿਖਿ ਲਿਖਿ ਧਰਮੁ ਵੀਚਾਰੇ ॥
ਗਾਵਹਿ ਈਸਰੁ ਬਰਮਾ ਦੇਵੀ ਸੋਹਨਿ ਸਦਾ ਸਵਾਰੇ ॥
ਗਾਵਹਿ ਇੰਦ ਇਦਾਸਣਿ ਬੈਠੇ ਦੇਵਤਿਆ ਦਰਿ ਨਾਲੇ ॥
ਗਾਵਹਿ ਸਿਧ ਸਮਾਧੀ ਅੰਦਰਿ ਗਾਵਨਿ ਸਾਧ ਵਿਚਾਰੇ ॥
ਗਾਵਨਿ ਜਤੀ ਸਤੀ ਸੰਤੋਖੀ ਗਾਵਹਿ ਵੀਰ ਕਰਾਰੇ ॥
ਗਾਵਨਿ ਪੰਡਿਤ ਪੜਨਿ ਰਖੀਸਰ ਜੁਗੁ ਜੁਗੁ ਵੇਦਾ ਨਾਲੇ ॥
ਗਾਵਹਿ ਮੋਹਣੀਆ ਮਨੁ ਮੋਹਨਿ ਸੁਰਗਾ ਮਛ ਪਇਆਲੇ ॥
ਗਾਵਨਿ ਰਤਨ ਉਪਾਏ ਤੇਰੇ ਅਠਸਠਿ ਤੀਰਥ ਨਾਲੇ ॥
ਗਾਵਹਿ ਜੋਧ ਮਹਾਬਲ ਸੂਰਾ ਗਾਵਹਿ ਖਾਣੀ ਚਾਰੇ ॥
ਗਾਵਹਿ ਖੰਡ ਮੰਡਲ ਵਰਭੰਡਾ ਕਰਿ ਕਰਿ ਰਖੇ ਧਾਰੇ ॥
ਸੇਈ ਤੁਧੁਨੋ ਗਾਵਹਿ ਜੋ ਤੁਧੁ ਭਾਵਨਿ ਰਤੇ ਤੇਰੇ ਭਗਤ ਰਸਾਲੇ ॥
ਹੋਰਿ ਕੇਤੇ ਗਾਵਨਿ ਸੇ ਮੈ ਚਿਤਿ ਨ ਆਵਨਿ ਨਾਨਕੁ ਕਿਆ ਵੀਚਾਰੇ ॥
ਸੋਈ ਸੋਈ ਸਦਾ ਸਚੁ ਸਾਹਿਬੁ ਸਾਚਾ ਸਾਚੀ ਨਾਈ ॥
ਹੈ ਭੀ ਹੋਸੀ ਜਾਇ ਨ ਜਾਸੀ ਰਚਨਾ ਜਿਨਿ ਰਚਾਈ ॥
ਰੰਗੀ ਰੰਗੀ ਭਾਤੀ ਕਰਿ ਕਰਿ ਜਿਨਸੀ ਮਾਇਆ ਜਿਨਿ ਉਪਾਈ ॥
ਕਰਿ ਕਰਿ ਵੇਖੈ ਕੀਤਾ ਆਪਣਾ ਜਿਵ ਤਿਸ ਦੀ ਵਡਿਆਈ ॥
ਜੋ ਤਿਸੁ ਭਾਵੈ ਸੋਈ ਕਰਸੀ ਹੁਕਮੁ ਨ ਕਰਣਾ ਜਾਈ ॥
ਸੋ ਪਾਤਿਸਾਹੁ ਸਾਹਾ ਪਾਤਿਸਾਹਿਬੁ ਨਾਨਕ ਰਹਣੁ ਰਜਾਈ ॥੨੭॥

ਮੁੰਦਾ ਸੰਤੋਖੁ ਸਰਮੁ ਪਤੁ ਝੋਲੀ ਧਿਆਨ ਕੀ ਕਰਹਿ ਬਿਭੂਤਿ ॥
ਖਿੰਥਾ ਕਾਲੁ ਕੁਆਰੀ ਕਾਇਆ ਜੁਗਤਿ ਡੰਡਾ ਪਰਤੀਤਿ ॥
ਆਈ ਪੰਥੀ ਸਗਲ ਜਮਾਤੀ ਮਨਿ ਜੀਤੈ ਜਗੁ ਜੀਤੁ ॥
ਆਦੇਸੁ ਤਿਸੈ ਆਦੇਸੁ ॥
ਆਦਿ ਅਨੀਲੁ ਅਨਾਦਿ ਅਨਾਹਤਿ ਜੁਗੁ ਜੁਗੁ ਏਕੋ ਵੇਸੁ ॥੨੮॥

ਭੁਗਤਿ ਗਿਆਨੁ ਦਇਆ ਭੰਡਾਰਣਿ ਘਟਿ ਘਟਿ ਵਾਜਹਿ ਨਾਦ ॥
ਆਪਿ ਨਾਥੁ ਨਾਥੀ ਸਭ ਜਾ ਕੀ ਰਿਧਿ ਸਿਧਿ ਅਵਰਾ ਸਾਦ ॥
ਸੰਜੋਗੁ ਵਿਜੋਗੁ ਦੁਇ ਕਾਰ ਚਲਾਵਹਿ ਲੇਖੇ ਆਵਹਿ ਭਾਗ ॥
ਆਦੇਸੁ ਤਿਸੈ ਆਦੇਸੁ ॥
ਆਦਿ ਅਨੀਲੁ ਅਨਾਦਿ ਅਨਾਹਤਿ ਜੁਗੁ ਜੁਗੁ ਏਕੋ ਵੇਸੁ ॥੨੯॥

ਏਕਾ ਮਾਈ ਜੁਗਤਿ ਵਿਆਈ ਤਿਨਿ ਚੇਲੇ ਪਰਵਾਣੁ ॥
ਇਕੁ ਸੰਸਾਰੀ ਇਕੁ ਭੰਡਾਰੀ ਇਕੁ ਲਾਏ ਦੀਬਾਣੁ ॥
ਜਿਵ ਤਿਸੁ ਭਾਵੈ ਤਿਵੈ ਚਲਾਵੈ ਜਿਵ ਹੋਵੈ ਫੁਰਮਾਣੁ ॥
ਓਹੁ ਵੇਖੈ ਓਨਾ ਨਦਰਿ ਨ ਆਵੈ ਬਹੁਤਾ ਏਹੁ ਵਿਡਾਣੁ ॥
ਆਦੇਸੁ ਤਿਸੈ ਆਦੇਸੁ ॥
ਆਦਿ ਅਨੀਲੁ ਅਨਾਦਿ ਅਨਾਹਤਿ ਜੁਗੁ ਜੁਗੁ ਏਕੋ ਵੇਸੁ ॥੩੦॥

ਆਸਣੁ ਲੋਇ ਲੋਇ ਭੰਡਾਰ ॥
ਜੋ ਕਿਛੁ ਪਾਇਆ ਸੁ ਏਕਾ ਵਾਰ ॥
ਕਰਿ ਕਰਿ ਵੇਖੈ ਸਿਰਜਣਹਾਰੁ ॥
ਨਾਨਕ ਸਚੇ ਕੀ ਸਾਚੀ ਕਾਰ ॥
ਆਦੇਸੁ ਤਿਸੈ ਆਦੇਸੁ ॥
ਆਦਿ ਅਨੀਲੁ ਅਨਾਦਿ ਅਨਾਹਤਿ ਜੁਗੁ ਜੁਗੁ ਏਕੋ ਵੇਸੁ ॥੩੧॥

ਇਕ ਦੂ ਜੀਭੌ ਲਖ ਹੋਹਿ ਲਖ ਹੋਵਹਿ ਲਖ ਵੀਸ ॥
ਲਖੁ ਲਖੁ ਗੇੜਾ ਆਖੀਅਹਿ ਏਕੁ ਨਾਮੁ ਜਗਦੀਸ ॥
ਏਤੁ ਰਾਹਿ ਪਤਿ ਪਵੜੀਆ ਚੜੀਐ ਹੋਇ ਇਕੀਸ ॥
ਸੁਣਿ ਗਲਾ ਆਕਾਸ ਕੀ ਕੀਟਾ ਆਈ ਰੀਸ ॥
ਨਾਨਕ ਨਦਰੀ ਪਾਈਐ ਕੂੜੀ ਕੂੜੈ ਠੀਸ ॥੩੨॥

ਆਖਣਿ ਜੋਰੁ ਚੁਪੈ ਨਹ ਜੋਰੁ ॥
ਜੋਰੁ ਨ ਮੰਗਣਿ ਦੇਣਿ ਨ ਜੋਰੁ ॥
ਜੋਰੁ ਨ ਜੀਵਣਿ ਮਰਣਿ ਨਹ ਜੋਰੁ ॥
ਜੋਰੁ ਨ ਰਾਜਿ ਮਾਲਿ ਮਨਿ ਸੋਰੁ ॥
ਜੋਰੁ ਨ ਸੁਰਤੀ ਗਿਆਨਿ ਵੀਚਾਰਿ ॥
ਜੋਰੁ ਨ ਜੁਗਤੀ ਛੁਟੈ ਸੰਸਾਰੁ ॥
ਜਿਸੁ ਹਥਿ ਜੋਰੁ ਕਰਿ ਵੇਖੈ ਸੋਇ ॥
ਨਾਨਕ ਉਤਮੁ ਨੀਚੁ ਨ ਕੋਇ ॥੩੩॥

ਰਾਤੀ ਰੁਤੀ ਥਿਤੀ ਵਾਰ ॥
ਪਵਣ ਪਾਣੀ ਅਗਨੀ ਪਾਤਾਲ ॥
ਤਿਸੁ ਵਿਚਿ ਧਰਤੀ ਥਾਪਿ ਰਖੀ ਧਰਮ ਸਾਲ ॥
ਤਿਸੁ ਵਿਚਿ ਜੀਅ ਜੁਗਤਿ ਕੇ ਰੰਗ ॥
ਤਿਨ ਕੇ ਨਾਮ ਅਨੇਕ ਅਨੰਤ ॥
ਕਰਮੀ ਕਰਮੀ ਹੋਇ ਵੀਚਾਰੁ ॥
ਸਚਾ ਆਪਿ ਸਚਾ ਦਰਬਾਰੁ ॥
ਤਿਥੈ ਸੋਹਨਿ ਪੰਚ ਪਰਵਾਣੁ ॥
ਨਦਰੀ ਕਰਮਿ ਪਵੈ ਨੀਸਾਣੁ ॥
ਕਚ ਪਕਾਈ ਓਥੈ ਪਾਇ ॥
ਨਾਨਕ ਗਇਆ ਜਾਪੈ ਜਾਇ ॥੩੪॥

ਧਰਮ ਖੰਡ ਕਾ ਏਹੋ ਧਰਮੁ ॥
ਗਿਆਨ ਖੰਡ ਕਾ ਆਖਹੁ ਕਰਮੁ ॥
ਕੇਤੇ ਪਵਣ ਪਾਣੀ ਵੈਸੰਤਰ ਕੇਤੇ ਕਾਨ ਮਹੇਸ ॥
ਕੇਤੇ ਬਰਮੇ ਘਾੜਤਿ ਘੜੀਅਹਿ ਰੂਪ ਰੰਗ ਕੇ ਵੇਸ ॥
ਕੇਤੀਆ ਕਰਮ ਭੂਮੀ ਮੇਰ ਕੇਤੇ ਕੇਤੇ ਧੂ ਉਪਦੇਸ ॥
ਕੇਤੇ ਇੰਦ ਚੰਦ ਸੂਰ ਕੇਤੇ ਕੇਤੇ ਮੰਡਲ ਦੇਸ ॥
ਕੇਤੇ ਸਿਧ ਬੁਧ ਨਾਥ ਕੇਤੇ ਕੇਤੇ ਦੇਵੀ ਵੇਸ ॥
ਕੇਤੇ ਦੇਵ ਦਾਨਵ ਮੁਨਿ ਕੇਤੇ ਕੇਤੇ ਰਤਨ ਸਮੁੰਦ ॥
ਕੇਤੀਆ ਖਾਣੀ ਕੇਤੀਆ ਬਾਣੀ ਕੇਤੇ ਪਾਤ ਨਰਿੰਦ ॥
ਕੇਤੀਆ ਸੁਰਤੀ ਸੇਵਕ ਕੇਤੇ ਨਾਨਕ ਅੰਤੁ ਨ ਅੰਤੁ ॥੩੫॥

ਗਿਆਨ ਖੰਡ ਮਹਿ ਗਿਆਨੁ ਪਰਚੰਡੁ ॥
ਤਿਥੈ ਨਾਦ ਬਿਨੋਦ ਕੋਡ ਅਨੰਦੁ ॥
ਸਰਮ ਖੰਡ ਕੀ ਬਾਣੀ ਰੂਪੁ ॥
ਤਿਥੈ ਘਾੜਤਿ ਘੜੀਐ ਬਹੁਤੁ ਅਨੂਪੁ ॥
ਤਾ ਕੀਆ ਗਲਾ ਕਥੀਆ ਨਾ ਜਾਹਿ ॥
ਜੇ ਕੋ ਕਹੈ ਪਿਛੈ ਪਛੁਤਾਇ ॥
ਤਿਥੈ ਘੜੀਐ ਸੁਰਤਿ ਮਤਿ ਮਨਿ ਬੁਧਿ ॥
ਤਿਥੈ ਘੜੀਐ ਸੁਰਾ ਸਿਧਾ ਕੀ ਸੁਧਿ ॥੩੬॥

ਕਰਮ ਖੰਡ ਕੀ ਬਾਣੀ ਜੋਰੁ ॥
ਤਿਥੈ ਹੋਰੁ ਨ ਕੋਈ ਹੋਰੁ ॥
ਤਿਥੈ ਜੋਧ ਮਹਾਬਲ ਸੂਰ ॥
ਤਿਨ ਮਹਿ ਰਾਮੁ ਰਹਿਆ ਭਰਪੂਰ ॥
ਤਿਥੈ ਸੀਤੋ ਸੀਤਾ ਮਹਿਮਾ ਮਾਹਿ ॥
ਤਾ ਕੇ ਰੂਪ ਨ ਕਥਨੇ ਜਾਹਿ ॥
ਨਾ ਓਹਿ ਮਰਹਿ ਨ ਠਾਗੇ ਜਾਹਿ ॥
ਜਿਨ ਕੈ ਰਾਮੁ ਵਸੈ ਮਨ ਮਾਹਿ ॥
ਤਿਥੈ ਭਗਤ ਵਸਹਿ ਕੇ ਲੋਅ ॥
ਕਰਹਿ ਅਨੰਦੁ ਸਚਾ ਮਨਿ ਸੋਇ ॥
ਸਚ ਖੰਡਿ ਵਸੈ ਨਿਰੰਕਾਰੁ ॥
ਕਰਿ ਕਰਿ ਵੇਖੈ ਨਦਰਿ ਨਿਹਾਲ ॥
ਤਿਥੈ ਖੰਡ ਮੰਡਲ ਵਰਭੰਡ ॥
ਜੇ ਕੋ ਕਥੈ ਤ ਅੰਤ ਨ ਅੰਤ ॥
ਤਿਥੈ ਲੋਅ ਲੋਅ ਆਕਾਰ ॥
ਜਿਵ ਜਿਵ ਹੁਕਮੁ ਤਿਵੈ ਤਿਵ ਕਾਰ ॥
ਵੇਖੈ ਵਿਗਸੈ ਕਰਿ ਵੀਚਾਰੁ ॥
ਨਾਨਕ ਕਥਨਾ ਕਰੜਾ ਸਾਰੁ ॥੩੭॥

ਜਤੁ ਪਾਹਾਰਾ ਧੀਰਜੁ ਸੁਨਿਆਰੁ ॥
ਅਹਰਣਿ ਮਤਿ ਵੇਦੁ ਹਥੀਆਰੁ ॥
ਭਉ ਖਲਾ ਅਗਨਿ ਤਪ ਤਾਉ ॥
ਭਾਂਡਾ ਭਾਉ ਅੰਮ੍ਰਿਤੁ ਤਿਤੁ ਢਾਲਿ ॥
ਘੜੀਐ ਸਬਦੁ ਸਚੀ ਟਕਸਾਲ ॥
ਜਿਨ ਕਉ ਨਦਰਿ ਕਰਮੁ ਤਿਨ ਕਾਰ ॥
ਨਾਨਕ ਨਦਰੀ ਨਦਰਿ ਨਿਹਾਲ ॥੩੮॥

ਸਲੋਕੁ ॥
ਪਵਣੁ ਗੁਰੂ ਪਾਣੀ ਪਿਤਾ ਮਾਤਾ ਧਰਤਿ ਮਹਤੁ ॥
ਦਿਵਸੁ ਰਾਤਿ ਦੁਇ ਦਾਈ ਦਾਇਆ ਖੇਲੈ ਸਗਲ ਜਗਤੁ ॥
ਚੰਗਿਆਈਆ ਬੁਰਿਆਈਆ ਵਾਚੈ ਧਰਮੁ ਹਦੂਰਿ ॥
ਕਰਮੀ ਆਪੋ ਆਪਣੀ ਕੇ ਨੇੜੈ ਕੇ ਦੂਰਿ ॥
ਜਿਨੀ ਨਾਮੁ ਧਿਆਇਆ ਗਏ ਮਸਕਤਿ ਘਾਲਿ ॥
ਨਾਨਕ ਤੇ ਮੁਖ ਉਜਲੇ ਕੇਤੀ ਛੁਟੀ ਨਾਲਿ ॥੧॥
""",


















































































































































































  

  "Jaap Sahib/ਜਾਪੁ ਸਾਹਿਬ": """
ਜਾਪੁ ॥

ਸ੍ਰੀ ਮੁਖਵਾਕ ਪਾਤਸਾਹੀ ੧੦ ॥

ਛਪੈ ਛੰਦ ॥ ਤ੍ਵਪ੍ਰਸਾਦਿ ॥
ਚਕ੍ਰ ਚਿਹਨ ਅਰੁ ਬਰਨ ਜਾਤਿ ਅਰੁ ਪਾਤਿ ਨਹਿਨ ਜਿਹ ॥
ਰੂਪ ਰੰਗ ਅਰੁ ਰੇਖ ਭੇਖ ਕੋਊ ਕਹਿ ਨ ਸਕਤਿ ਕਿਹ ॥
ਅਚਲ ਮੂਰਤਿ ਅਨਭਉ ਪ੍ਰਕਾਸ ਅਮਿਤੋਜ ਕਹਿਜੈ ॥

ਕੋਟਿ ਇੰਦ੍ਰ ਇੰਦ੍ਰਾਣਿ ਸਾਹੁ ਸਾਹਾਣਿ ਗਣਿਜੈ ॥
ਤ੍ਰਿਭਵਣ ਮਹੀਪ ਸੁਰ ਨਰ ਅਸੁਰ ਨੇਤਿ ਨੇਤਿ ਬਨ ਤ੍ਰਿਣ ਕਹਤ ॥
ਤ੍ਵ ਸਰਬ ਨਾਮ ਕਥੈ ਕਵਨ ਕਰਮ ਨਾਮ ਬਰਣਤ ਸੁਮਤਿ ॥੧॥

ਭੁਜੰਗ ਪ੍ਰਯਾਤ ਛੰਦ ॥ ਨਮਸਤ੍ਵੰ ਅਕਾਲੇ ॥ ਨਮਸਤ੍ਵੰ ਕ੍ਰਿਪਾਲੇ ॥
ਨਮਸਤ੍ਵੰ ਅਰੂਪੇ ॥ ਨਮਸਤ੍ਵੰ ਅਨੂਪੇ ॥੧॥੨॥

ਨਮਸਤੰ ਅਭੇਖੇ ॥ ਨਮਸਤੰ ਅਲੇਖੇ ॥
ਨਮਸਤੰ ਅਕਾਏ ॥ ਨਮਸਤੰ ਅਜਾਏ ॥੨॥੩॥

ਨਮਸਤੰ ਅਗੰਜੇ ॥ ਨਮਸਤੰ ਅਭੰਜੇ ॥
ਨਮਸਤੰ ਅਨਾਮੇ ॥ ਨਮਸਤੰ ਅਠਾਮੇ ॥੩॥੪॥

ਨਮਸਤੰ ਅਕਰਮੰ ॥ ਨਮਸਤੰ ਅਧਰਮੰ ॥
ਨਮਸਤੰ ਅਨਾਮੰ ॥ ਨਮਸਤੰ ਅਧਾਮੰ ॥੪॥੫॥

ਨਮਸਤੰ ਅਜੀਤੇ ॥ ਨਮਸਤੰ ਅਭੀਤੇ ॥
ਨਮਸਤੰ ਅਬਾਹੇ ॥ ਨਮਸਤੰ ਅਢਾਹੇ ॥੫॥੬॥

ਨਮਸਤੰ ਅਨੀਲੇ ॥ ਨਮਸਤੰ ਅਨਾਦੇ ॥
ਨਮਸਤੰ ਅਛੇਦੇ ॥ ਨਮਸਤੰ ਅਗਾਧੇ ॥੬॥੭॥

ਨਮਸਤੰ ਅਗੰਜੇ ॥ ਨਮਸਤੰ ਅਭੰਜੇ ॥
ਨਮਸਤੰ ਉਦਾਰੇ ॥ ਨਮਸਤੰ ਅਪਾਰੇ ॥੭॥੮॥

ਨਮਸਤੰ ਸੁ ਏਕੈ ॥ ਨਮਸਤੰ ਅਨੇਕੈ ॥
ਨਮਸਤੰ ਅਭੂਤੇ ॥ ਨਮਸਤੰ ਅਜੂਪੇ ॥੮॥੯॥

ਨਮਸਤੰ ਨ੍ਰਿਕਰਮੇ ॥ ਨਮਸਤੰ ਨ੍ਰਿਭਰਮੇ ॥
ਨਮਸਤੰ ਨ੍ਰਿਦੇਸੇ ॥ ਨਮਸਤੰ ਨ੍ਰਿਭੇਸੇ ॥੯॥੧੦॥

ਨਮਸਤੰ ਨ੍ਰਿਨਾਮੇ ॥ ਨਮਸਤੰ ਨ੍ਰਿਕਾਮੇ ॥
ਨਮਸਤੰ ਨ੍ਰਿਧਾਤੇ ॥ ਨਮਸਤੰ ਨ੍ਰਿਘਾਤੇ ॥੧੦॥੧੧॥

ਨਮਸਤੰ ਨ੍ਰਿਧੂਤੇ ॥ ਨਮਸਤੰ ਅਭੂਤੇ ॥
ਨਮਸਤੰ ਅਲੋਕੇ ॥ ਨਮਸਤੰ ਅਸੋਕੇ ॥੧੧॥੧੨॥

ਨਮਸਤੰ ਨ੍ਰਿਤਾਪੇ ॥ ਨਮਸਤੰ ਅਥਾਪੇ ॥
ਨਮਸਤੰ ਤ੍ਰਿਮਾਨੇ ॥ ਨਮਸਤੰ ਨਿਧਾਨੇ ॥੧੨॥੧੩॥

ਨਮਸਤੰ ਅਗਾਹੇ ॥ ਨਮਸਤੰ ਅਬਾਹੇ ॥
ਨਮਸਤੰ ਤ੍ਰਿਬਰਗੇ ॥ ਨਮਸਤੰ ਅਸਰਗੇ ॥੧੩॥੧੪॥

ਨਮਸਤੰ ਪ੍ਰਭੋਗੇ ॥ ਨਮਸਤੰ ਸੁਜੋਗੇ ॥
ਨਮਸਤੰ ਅਰੰਗੇ ॥ ਨਮਸਤੰ ਅਭੰਗੇ ॥੧੪॥੧੫॥

ਨਮਸਤੰ ਅਗੰਮੇ ॥ ਨਮਸਤਸਤੁ ਰੰਮੇ ॥
ਨਮਸਤੰ ਜਲਾਸਰੇ ॥ ਨਮਸਤੰ ਨਿਰਾਸਰੇ ॥੧੫॥੧੬॥

ਨਮਸਤੰ ਅਜਾਤੇ ॥ ਨਮਸਤੰ ਅਪਾਤੇ ॥
ਨਮਸਤੰ ਅਮਜਬੇ ॥ ਨਮਸਤਸਤੁ ਅਜਬੇ ॥੧੬॥੧੭॥

ਅਦੇਸੰ ਅਦੇਸੇ ॥ ਨਮਸਤੰ ਅਭੇਸੇ ॥
ਨਮਸਤੰ ਨ੍ਰਿਧਾਮੇ ॥ ਨਮਸਤੰ ਨ੍ਰਿਬਾਮੇ ॥੧੭॥੧੮॥

ਨਮੋ ਸਰਬ ਕਾਲੇ ॥ ਨਮੋ ਸਰਬ ਦਿਆਲੇ ॥
ਨਮੋ ਸਰਬ ਰੂਪੇ ॥ ਨਮੋ ਸਰਬ ਭੂਪੇ ॥੧੮॥੧੯॥

ਨਮੋ ਸਰਬ ਖਾਪੇ ॥ ਨਮੋ ਸਰਬ ਥਾਪੇ ॥
ਨਮੋ ਸਰਬ ਕਾਲੇ ॥ ਨਮੋ ਸਰਬ ਪਾਲੇ ॥੧੯॥੨੦॥

ਨਮਸਤਸਤੁ ਦੇਵੈ ॥ ਨਮਸਤੰ ਅਭੇਵੈ ॥
ਨਮਸਤੰ ਅਜਨਮੇ ॥ਨਮਸਤੰ ਸੁਬਨਮੇ ॥੨੦॥੨੧॥

ਨਮੋ ਸਰਬ ਗਉਨੇ ॥ ਨਮੋ ਸਰਬ ਭਉਨੇ ॥
ਨਮੋ ਸਰਬ ਰੰਗੇ ॥ ਨਮੋ ਸਰਬ ਭੰਗੇ ॥੨੧॥੨੨॥

ਨਮੋ ਕਾਲ ਕਾਲੇ ॥ ਨਮਸਤਸਤੁ ਦਿਆਲੇ ॥
ਨਮਸਤੰ ਅਬਰਨੇ ॥ ਨਮਸਤੰ ਅਮਰਨੇ ॥੨੨॥੨੩॥

ਨਮਸਤੰ ਜਰਾਰੰ ॥ ਨਮਸਤੰ ਕ੍ਰਿਤਾਰੰ ॥
ਨਮੋ ਸਰਬ ਧੰਧੇ ॥ ਨਮੋ ਸਤ ਅਬੰਧੇ ॥੨੩॥੨੪॥

ਨਮਸਤੰ ਨ੍ਰਿਸਾਕੇ ॥ ਨਮਸਤੰ ਨ੍ਰਿਬਾਕੇ ॥
ਨਮਸਤੰ ਰਹੀਮੇ ॥ ਨਮਸਤੰ ਕਰੀਮੇ ॥੨੪॥੨੫॥

ਨਮਸਤੰ ਅਨੰਤੇ ॥ ਨਮਸਤੰ ਮਹੰਤੇ ॥
ਨਮਸਤਸਤੁ ਰਾਗੇ ॥ ਨਮਸਤੰ ਸੁਹਾਗੇ ॥੨੫॥੨੬॥

ਨਮੋ ਸਰਬ ਸੋਖੰ ॥ ਨਮੋ ਸਰਬ ਪੋਖੰ ॥
ਨਮੋ ਸਰਬ ਕਰਤਾ ॥ ਨਮੋ ਸਰਬ ਹਰਤਾ ॥੨੬॥੨੭॥

ਨਮੋ ਜੋਗ ਜੋਗੇ ॥ ਨਮੋ ਭੋਗ ਭੋਗੇ ॥
ਨਮੋ ਸਰਬ ਦਿਆਲੇ ॥ ਨਮੋ ਸਰਬ ਪਾਲੇ ॥੨੭॥੨੮॥

ਚਾਚਰੀ ਛੰਦ ॥ ਤ੍ਵਪ੍ਰਸਾਦਿ ॥

ਅਰੂਪ ਹੈਂ ॥ ਅਨੂਪ ਹੈਂ ॥
ਅਜੂ ਹੈਂ ॥ ਅਭੂ ਹੈਂ ॥੧॥੨੯॥

ਅਲੇਖ ਹੈਂ ॥ਅਭੇਖ ਹੈਂ ॥
ਅਨਾਮ ਹੈਂ ॥ ਅਕਾਮ ਹੈਂ ॥੨॥੩੦॥

ਅਧੇ ਹੈਂ ॥ ਅਭੇ ਹੈਂ ॥
ਅਜੀਤ ਹੈਂ ॥ ਅਭੀਤ ਹੈਂ ॥੩॥੩੧॥

ਤ੍ਰਿਮਾਨ ਹੈਂ ॥ ਨਿਧਾਨ ਹੈਂ ॥
ਤ੍ਰਿਬਰਗ ਹੈਂ ॥ ਅਸਰਗ ਹੈਂ ॥੪॥੩੨॥

ਅਨੀਲ ਹੈਂ ॥ ਅਨਾਦਿ ਹੈਂ ॥
ਅਜੇ ਹੈਂ ॥ ਅਜਾਦਿ ਹੈਂ ॥੫॥੩੩॥

ਅਜਨਮ ਹੈਂ ॥ ਅਬਰਨ ਹੈਂ ॥
ਅਭੂਤ ਹੈਂ ॥ ਅਭਰਨ ਹੈਂ ॥੬॥੩੪॥

ਅਗੰਜ ਹੈਂ ॥ ਅਭੰਜ ਹੈਂ ॥
ਅਝੂਝ ਹੈਂ ॥ ਅਝੰਝ ਹੈਂ ॥੭॥੩੫॥

ਅਮੀਕ ਹੈਂ ॥ ਰਫੀਕ ਹੈਂ ॥
ਅਧੰਧ ਹੈਂ ॥ ਅਬੰਧ ਹੈਂ ॥੮॥੩੬॥

ਨ੍ਰਿਬੂਝ ਹੈਂ ॥ ਅਸੂਝ ਹੈਂ ॥
ਅਕਾਲ ਹੈਂ ॥ ਅਜਾਲ ਹੈਂ ॥੯॥੩੭॥

ਅਲਾਹ ਹੈਂ ॥ ਅਜਾਹ ਹੈਂ ॥
ਅਨੰਤ ਹੈਂ ॥ ਮਹੰਤ ਹੈਂ ॥੧੦॥੩੮॥

ਅਲੀਕ ਹੈਂ ॥ ਨ੍ਰਿਸ੍ਰੀਕ ਹੈਂ ॥
ਨ੍ਰਿਲੰਭ ਹੈਂ ॥ ਅਸੰਭ ਹੈਂ ॥੧੧॥੩੯॥

ਅਗੰਮ ਹੈਂ ॥ ਅਜੰਮ ਹੈਂ ॥
ਅਭੂਤ ਹੈਂ ॥ਅਛੂਤ ਹੈਂ ॥੧੨॥੪੦॥

ਅਲੋਕ ਹੈਂ ॥ ਅਸੋਕ ਹੈਂ ॥
ਅਕਰਮ ਹੈਂ ॥ ਅਭਰਮ ਹੈਂ ॥੧੩॥੪੧॥

ਅਜੀਤ ਹੈਂ ॥ ਅਭੀਤ ਹੈਂ ॥
ਅਬਾਹ ਹੈਂ ॥ ਅਗਾਹ ਹੈਂ ॥੧੪॥੪੨॥

ਅਮਾਨ ਹੈਂ ॥ ਨਿਧਾਨ ਹੈਂ ॥
ਅਨੇਕ ਹੈਂ ॥ ਫਿਰਿ ਏਕ ਹੈਂ ॥੧੫॥੪੩॥

ਭੁਜੰਗ ਪ੍ਰਯਾਤ ਛੰਦ ॥ ਨਮੋ ਸਰਬ ਮਾਨੇ ॥
ਸਮਸਤੀ ਨਿਧਾਨੇ ॥ ਨਮੋ ਦੇਵ ਦੇਵੇ ॥
ਅਭੇਖੀ ਅਭੇਵੇ ॥੧॥੪੪॥

ਨਮੋ ਕਾਲ ਕਾਲੇ ॥ ਨਮੋ ਸਰਬ ਪਾਲੇ ॥
ਨਮੋ ਸਰਬ ਗਉਣੇ ॥ ਨਮੋ ਸਰਬ ਭਉਣੇ ॥੨॥੪੫॥

ਅਨੰਗੀ ਅਨਾਥੇ ॥ ਨ੍ਰਿਸੰਗੀ ਪ੍ਰਮਾਥੇ ॥
ਨਮੋ ਭਾਨ ਭਾਨੇ ॥ ਨਮੋ ਮਾਨ ਮਾਨੇ ॥੩॥੪੬॥

ਨਮੋ ਚੰਦ੍ਰੇ ਚੰਦ੍ਰੇ ॥ ਨਮੋ ਭਾਨ ਭਾਨੇ ॥
ਨਮੋ ਗੀਤ ਗੀਤੇ ॥ ਨਮੋ ਤਾਨ ਤਾਨੇ ॥੪॥੪੭॥

ਨਮੋ ਨ੍ਰਿਤ ਨ੍ਰਿਤੇ ॥ ਨਮੋ ਨਾਦ ਨਾਦੇ ॥
ਨਮੋ ਪਾਨ ਪਾਨੇ ॥ ਨਮੋ ਬਾਦ ਬਾਦੇ ॥੫॥੪੮॥

ਅਨੰਗੀ ਅਨਾਮੇ ॥ ਸਮਸਤੀ ਸਰੂਪੇ ॥
ਪ੍ਰਭੰਗੀ ਪ੍ਰਮਾਥੇ ॥ ਸਮਸਤੀ ਬਿਭੂਤੇ ॥੬॥੪੯॥

ਕਲੰਕੰ ਬਿਨਾ ਨੇਹਕਲੰਕੀ ਸਰੂਪੇ ॥
ਨਮੋ ਰਾਜ ਰਾਜੇਸ੍ਵਰੰ ਪਰਮ ਰੂਪੇ ॥੭॥੫੦॥

ਨਮੋ ਜੋਗ ਜੋਗੇਸ੍ਵਰੰ ਪਰਮ ਸਿਧੇ ॥
ਨਮੋ ਰਾਜ ਰਾਜੇਸ੍ਵਰੰ ਪਰਮ ਬ੍ਰਿਧੇ ॥੮॥੫੧॥

ਨਮੋ ਸਸਤ੍ਰ ਪਾਣੇ ॥ ਨਮੋ ਅਸਤ੍ਰ ਮਾਣੇ ॥
ਨਮੋ ਪਰਮ ਗਿਆਤਾ ॥ ਨਮੋ ਲੋਕ ਮਾਤਾ ॥੯॥੫੨॥

ਅਭੇਖੀ ਅਭਰਮੀ ਅਭੋਗੀ ਅਭੁਗਤੇ ॥
ਨਮੋ ਜੋਗ ਜੋਗੇਸ੍ਵਰੰ ਪਰਮ ਜੁਗਤੇ ॥੧੦॥੫੩॥

ਨਮੋ ਨਿਤ ਨਾਰਾਇਣੇ ਕ੍ਰੂਰ ਕਰਮੇ ॥
ਨਮੋ ਪ੍ਰੇਤ ਅਪ੍ਰੇਤ ਦੇਵੇ ਸੁਧਰਮੇ ॥੧੧॥੫੪॥

ਨਮੋ ਰੋਗ ਹਰਤਾ ॥ ਨੋਮ ਰਾਗ ਰੂਪੇ ॥
ਨਮੋ ਸਾਹ ਸਾਹੰ ॥ ਨਮੋ ਭੂਪ ਭੂਪੇ ॥੧੨॥੫੫॥

ਨਮੋ ਦਾਨ ਦਾਨੇ ॥ ਨਮੋ ਮਾਨ ਮਾਨੇ ॥
ਨਮੋ ਰੋਗ ਰੋਗੇ ॥ ਨਮਸਤੰ ਸਨਾਨੇ ॥੧੩॥੫੬॥

ਨਮੋ ਮੰਤ੍ਰ ਮੰਤ੍ਰੰ ॥ ਨਮੋ ਜੰਤ੍ਰ ਜੰਤ੍ਰੰ ॥
ਨਮੋ ਇਸਟੇ ਇਸਟੇ ॥ ਨਮੋ ਤੰਤ੍ਰ ਤੰਤ੍ਰੰ ॥੧੪॥੫੭॥

ਸਦਾ ਸਚਿਦਾਨੰਦ ਸਰਬੰ ਪ੍ਰਣਾਸੀ ॥
ਅਨੂਪੇ ਅਰੂਪੇ ਸਮਸਤੁਲ ਨਿਵਾਸੀ ॥੧੫॥੫੮॥

ਸਦਾ ਸਿਧਿਦਾ ਬੁਧਿਦਾ ਬ੍ਰਿਧਿ ਕਰਤਾ ॥
ਅਧੋ ਉਰਧ ਅਰਧੰ ਅਘੰ ਓਘ ਹਰਤਾ ॥੧੬॥੫੯॥

ਪਰੰ ਪਰਮ ਪਰਮੇਸ੍ਵਰੰ ਪ੍ਰੋਛਪਾਲੰ ॥
ਸਦਾ ਸਰਬਦਾ ਸਿਧਿ ਦਾਤਾ ਦਿਆਲੰ ॥੧੭॥੬੦॥

ਅਛੇਦੀ ਅਭੇਦੀ ਅਨਾਮੰ ਅਕਾਮੰ ॥
ਸਮਸਤੋ ਪਰਾਜੀ ਸਮਸਤਸਤੁ ਧਾਮੰ ॥੧੮॥੬੧॥

ਤੇਰਾ ਜੋਰੁ ॥ ਚਾਚਰੀ ਛੰਦ ॥ ਜਲੇ ਹੈਂ ॥
ਥਲੇ ਹੈਂ ॥ ਅਭੀਤ ਹੈਂ ॥ ਅਭੇ ਹੈਂ ॥੧॥੬੨॥

ਪ੍ਰਭੂ ਹੈਂ ॥ ਅਜੂ ਹੈਂ ॥
ਅਦੇਸ ਹੈਂ ॥ ਅਭੇਸ ਹੈਂ ॥੨॥੬੩॥

ਭੁਜੰਗ ਪ੍ਰਯਾਤ ਛੰਦ ॥ ਤ੍ਵਪ੍ਰਸਾਦਿ ॥

ਅਗਾਧੇ ਅਬਾਧੇ ॥ ਅਨੰਦੀ ਸਰੂਪੇ ॥
ਨਮੋ ਸਰਬ ਮਾਨੇ ॥ ਸਮਸਤੀ ਨਿਧਾਨੇ ॥੧॥੬੪॥

ਨਮਸਤ੍ਵੰ ਨ੍ਰਿਨਾਥੇ ॥ ਨਮਸਤ੍ਵੰ ਪ੍ਰਮਾਥੇ ॥
ਨਮਸਤ੍ਵੰ ਅਗੰਜੇ ॥ ਨਮਸਤ੍ਵੰ ਅਭੰਜੇ ॥੨॥੬੫॥

ਨਮਸਤ੍ਵੰ ਅਕਾਲੇ ॥ ਨਮਸਤ੍ਵੰ ਅਪਾਲੇ ॥
ਨਮੋ ਸਰਬ ਦੇਸੇ ॥ ਨਮੋ ਸਰਬ ਭੇਸੇ ॥੩॥੬੬॥

ਨਮੋ ਰਾਜ ਰਾਜੇ ॥ ਨਮੋ ਸਾਜ ਸਾਜੇ ॥
ਨਮੋ ਸਾਹ ਸਾਹੇ ॥ ਨਮੋ ਮਾਹ ਮਾਹੇ ॥੪॥੬੭॥

ਨਮੋ ਗੀਤ ਗੀਤੇ ॥ ਨਮੋ ਪ੍ਰੀਤਿ ਪ੍ਰੀਤੇ ॥
ਨਮੋ ਰੋਖ ਰੋਖੇ ॥ ਨਮੋ ਸੋਖ ਸੋਖੇ ॥੫॥੬੮॥

ਨਮੋ ਸਰਬ ਰੋਗੇ ॥ ਨਮੋ ਸਰਬ ਭੋਗੇ ॥
ਨਮੋ ਸਰਬ ਜੀਤੰ ॥ ਨਮੋ ਸਰਬ ਭੀਤੰ ॥੬॥੬੯॥

ਨਮੋ ਸਰਬ ਗਿਆਨੰ ॥ ਨਮੋ ਪਰਮ ਤਾਨੰ ॥
ਨਮੋ ਸਰਬ ਮੰਤ੍ਰੰ ॥ ਨਮੋ ਸਰਬ ਜੰਤ੍ਰੰ ॥੭॥੭੦॥

ਨਮੋ ਸਰਬ ਦ੍ਰਿਸੰ ॥ ਨਮੋ ਸਰਬ ਕ੍ਰਿਸੰ ॥
ਨਮੋ ਸਰਬ ਰੰਗੇ ॥ ਤ੍ਰਿਭੰਗੀ ਅਨੰਗੇ ॥੮॥੭੧॥

ਨਮੋ ਜੀਵ ਜੀਵੰ ॥ ਨਮੋ ਬੀਜ ਬੀਜੇ ॥
ਅਖਿਜੇ ਅਭਿਜੇ ॥ ਸਮਸਤੰ ਪ੍ਰਸਿਜੇ ॥੯॥੭੨॥

ਕ੍ਰਿਪਾਲੰ ਸਰੂਪੇ ॥ ਕੁਕਰਮੰ ਪ੍ਰਣਾਸੀ ॥
ਸਦਾ ਸਰਬਦਾ ਰਿਧਿ ਸਿਧੰ ਨਿਵਾਸੀ ॥੧੦॥੭੩॥

ਚਰਪਟ ਛੰਦ ॥ ਤ੍ਵਪ੍ਰਸਾਦਿ ॥

ਅੰਮ੍ਰਿਤ ਕਰਮੇ ॥ ਅੰਬ੍ਰਿਤ ਧਰਮੇ ॥
ਅਖਿਲ ਜੋਗੇ ॥ ਅਚਲ ਭੋਗੇ ॥੧॥੭੪॥

ਅਚਲ ਰਾਜੇ ॥ ਅਟਲ ਸਾਜੇ ॥
ਅਖਲ ਧਰਮੰ ॥ ਅਲਖ ਕਰਮੰ ॥੨॥੭੫॥

ਸਰਬੰ ਦਾਤਾ ॥ ਸਰਬੰ ਗਿਆਤਾ ॥
ਸਰਬੰ ਭਾਨੇ ॥ ਸਰਬੰ ਮਾਨੇ ॥੩॥੭੬॥

ਸਰਬੰ ਪ੍ਰਾਣੰ ॥ ਸਰਬੰ ਤ੍ਰਾਣੰ ॥
ਸਰਬੰ ਭੁਗਤਾ ॥ ਸਰਬੰ ਜੁਗਤਾ ॥੪॥੭੭॥

ਸਰਬੰ ਦੇਵੰ ॥ ਸਰਬੰ ਭੇਵੰ ॥
ਸਰਬੰ ਕਾਲੇ ॥ ਸਰਬੰ ਪਾਲੇ ॥੫॥੭੮॥

ਰੂਆਲ ਛੰਦ ॥ ਤ੍ਵਪ੍ਰਸਾਦਿ ॥

ਆਦਿ ਰੂਪ ਅਨਾਦਿ ਮੂਰਤਿ ਅਜੋਨਿ ਪੁਰਖ ਅਪਾਰ ॥
ਸਰਬ ਮਾਨ ਤ੍ਰਿਮਾਨ ਦੇਵ ਅਭੇਵ ਆਦਿ ਉਦਾਰ ॥
ਸਰਬ ਪਾਲਕ ਸਰਬ ਘਾਲਕ ਸਰਬ ਕੋ ਪੁਨਿ ਕਾਲ ॥
ਜਤ੍ਰ ਤਤ੍ਰ ਬਿਰਾਜਹੀ ਅਵਧੂਤ ਰੂਪ ਰਿਸਾਲ ॥੧॥੭੯॥

ਨਾਮ ਠਾਮ ਨ ਜਾਤਿ ਜਾਕਰ ਰੂਪ ਰੰਗ ਨ ਰੇਖ ॥
ਆਦਿ ਪੁਰਖ ਉਦਾਰ ਮੂਰਤਿ ਅਜੋਨਿ ਆਦਿ ਅਸੇਖ ॥
ਦੇਸ ਅਉਰ ਨ ਭੇਸ ਜਾਕਰ ਰੂਪ ਰੇਖ ਨ ਰਾਗ ॥
ਜਤ੍ਰ ਤਤ੍ਰ ਦਿਸਾ ਵਿਸਾ ਹੁਇ ਫੈਲਿਓ ਅਨੁਰਾਗ ॥੨॥੮੦॥

ਨਾਮ ਕਾਮ ਬਿਹੀਨ ਪੇਖਤ ਧਾਮ ਹੂੰ ਨਹਿ ਜਾਹਿ ॥
ਸਰਬ ਮਾਨ ਸਰਬਤ੍ਰ ਮਾਨ ਸਦੈਵ ਮਾਨਤ ਤਾਹਿ ॥
ਏਕ ਮੂਰਤਿ ਅਨੇਕ ਦਰਸਨ ਕੀਨ ਰੂਪ ਅਨੇਕ ॥
ਖੇਲ ਖੇਲਿ ਅਖੇਲ ਖੇਲਨ ਅੰਤ ਕੋ ਫਿਰਿ ਏਕ ॥੩॥੮੧॥

ਦੇਵ ਭੇਵ ਨ ਜਾਨਹੀ ਜਿਹ ਬੇਦ ਅਉਰ ਕਤੇਬ ॥
ਰੂਪ ਰੰਗ ਨ ਜਾਤਿ ਪਾਤਿ ਸੁ ਜਾਨਈ ਕਿਹ ਜੇਬ ॥
ਤਾਤ ਮਾਤ ਨ ਜਾਤ ਜਾ ਕਰ ਜਨਮ ਮਰਨ ਬਿਹੀਨ ॥
ਚਕ੍ਰ ਬਕ੍ਰ ਫਿਰੈ ਚਤ੍ਰ ਚਕਿ ਮਾਨਹੀ ਪੁਰ ਤੀਨ ॥੪॥੮੨॥

ਲੋਕ ਚਉਦਹ ਕੇ ਬਿਖੈ ਜਗ ਜਾਪਹੀ ਜਿਹ ਜਾਪੁ ॥
ਆਦਿ ਦੇਵ ਅਨਾਦਿ ਮੂਰਤਿ ਥਾਪਿਓ ਸਬੈ ਜਿਹ ਥਾਪੁ ॥
ਪਰਮ ਰੂਪ ਪੁਨੀਤ ਮੂਰਤਿ ਪੂਰਨ ਪੁਰਖੁ ਅਪਾਰ ॥
ਸਰਬ ਬਿਸ੍ਵ ਰਚਿਓ ਸੁਯੰਭਵ ਗੜਨ ਭੰਜਨ ਹਾਰ ॥੫॥੮੩॥

ਕਾਲ ਹੀਨ ਕਲਾ ਸੰਜੁਗਤਿ ਅਕਾਲ ਪੁਰਖ ਅਦੇਸ ॥
ਧਰਮ ਧਾਮ ਸੁ ਭਰਮ ਰਹਤ ਅਭੂਤ ਅਲਖ ਅਭੇਸ ॥
ਅੰਗ ਰਾਗ ਨ ਰੰਗ ਜਾ ਕਹਿ ਜਾਤਿ ਪਾਤਿ ਨ ਨਾਮ ॥
ਗਰਬ ਗੰਜਨ ਦੁਸਟ ਭੰਜਨ ਮੁਕਤ ਦਾਇਕ ਕਾਮ ॥੬॥੮੪॥

ਆਪ ਰੂਪ ਅਮੀਕ ਅਨਉਸਤਤਿ ਏਕ ਪੁਰਖੁ ਅਵਧੂਤ ॥
ਗਰਬ ਗੰਜਨ ਸਰਬ ਭੰਜਨ ਆਦਿ ਰੂਪ ਅਸੂਤ ॥
ਅੰਗ ਹੀਨ ਅਭੰਗ ਅਨਾਤਮ ਏਕ ਪੁਰਖੁ ਅਪਾਰ ॥
ਸਰਬ ਲਾਇਕ ਸਰਬ ਘਾਇਕ ਸਰਬ ਕੋ ਪ੍ਰਤਿਪਾਰ ॥੭॥੮੫॥

ਸਰਬ ਗੰਤਾ ਸਰਬ ਹੰਤਾ ਸਰਬ ਤੇ ਅਨਭੇਖ ॥
ਸਰਬ ਸਾਸਤ੍ਰ ਨ ਜਾਨਹੀ ਜਿਹ ਰੂਪ ਰੰਗੁ ਅਰੁ ਰੇਖ ॥
ਪਰਮ ਬੇਦ ਪੁਰਾਣ ਜਾਕਹਿ ਨੇਤਿ ਭਾਖਤ ਨਿਤ ॥
ਕੋਟਿ ਸਿੰਮ੍ਰਿਤਿ ਪੁਰਾਨ ਸਾਸਤ੍ਰ ਨ ਆਵਈ ਵਹੁ ਚਿਤਿ ॥੮॥੮੬॥

ਮਧੁਭਾਰ ਛੰਦ ॥ ਤ੍ਵਪ੍ਰਸਾਦਿ ॥

ਗੁਨ ਗਨ ਉਦਾਰ ॥ ਮਹਿਮਾ ਅਪਾਰ ॥
ਆਸਨ ਅਭੰਗ ॥ ਉਪਮਾ ਅਨੰਗ ॥੧॥੮੭॥

ਅਨਭਉ ਪ੍ਰਕਾਸ ॥ ਨਿਸ ਦਿਨ ਅਨਾਸ ॥
ਆਜਾਨੁ ਬਾਹੁ ॥ ਸਾਹਾਨੁ ਸਾਹੁ ॥੨॥੮੮॥

ਰਾਜਾਨ ਰਾਜ ॥ ਭਾਨਾਨ ਭਾਨੁ ॥
ਦੇਵਾਨ ਦੇਵ ॥ ਉਪਮਾ ਮਹਾਨ ॥੩॥੮੯॥

ਇੰਦ੍ਰਾਨ ਇੰਦ੍ਰ ॥ ਬਾਲਾਨ ਬਾਲ ॥
ਰੰਕਾਨ ਰੰਕ ॥ ਕਾਲਾਨ ਕਾਲ ॥੪॥੯੦॥

ਅਨਭੂਤ ਅੰਗ ॥ ਆਭਾ ਅਭੰਗ ॥
ਗਤਿ ਮਿਤਿ ਅਪਾਰ ॥
ਗੁਨ ਗਨ ਉਦਾਰ ॥੫॥੯੧॥

ਮੁਨਿ ਗਨ ਪ੍ਰਨਾਮ ॥ ਨਿਰਭੈ ਨ੍ਰਿਕਾਮ ॥
ਅਤਿ ਦੁਤਿ ਪ੍ਰਚੰਡ ॥ ਮਿਤਿ ਗਤਿ ਅਖੰਡ ॥੬॥੯੨॥

ਆਲਿਸ੍ਯ ਕਰਮ ॥ ਆਦ੍ਰਿਸ੍ਯ ਧਰਮ ॥
ਸਰਬਾ ਭਰਣਾਢ੍ਯ ॥ ਅਨਡੰਡ ਬਾਢ੍ਯ ॥੭॥੯੩॥

ਚਾਚਰੀ ਛੰਦ ॥ ਤ੍ਵਪ੍ਰਸਾਦਿ ॥
ਗੁਬਿੰਦੇ ॥ ਮੁਕੰਦੇ ॥ ਉਦਾਰੇ ॥
ਅਪਾਰੇ ॥੧॥੯੪॥

ਹਰੀਅੰ ॥ ਕਰੀਅੰ ॥ ਨ੍ਰਿਨਾਮੇ ॥
ਅਕਾਮੇ ॥੨॥੯੫॥

ਭੁਜੰਗ ਪ੍ਰਯਾਤ ਛੰਦ ॥ ਚਤ੍ਰ ਚਕ੍ਰ ਕਰਤਾ ॥
ਚਤ੍ਰ ਚਕ੍ਰ ਹਰਤਾ ॥ ਚਤ੍ਰ ਚਕ੍ਰ ਦਾਨੇ ॥
ਚਤ੍ਰ ਚਕ੍ਰ ਜਾਨੇ ॥੧॥੯੬॥

ਚਤ੍ਰ ਚਕ੍ਰ ਵਰਤੀ ॥ ਚਤ੍ਰ ਚਕ੍ਰ ਭਰਤੀ ॥
ਚਤ੍ਰ ਚਕ੍ਰ ਪਾਲੇ ॥ ਚਤ੍ਰ ਚਕ੍ਰ ਕਾਲੇ ॥੨॥੯੭॥

ਚਤ੍ਰ ਚਕ੍ਰ ਪਾਸੇ ॥ ਚਤ੍ਰ ਚਕ੍ਰ ਵਾਸੇ ॥
ਚਤ੍ਰ ਚਕ੍ਰ ਮਾਨ੍ਯੈ ॥ ਚਤ੍ਰ ਚਕ੍ਰ ਦਾਨ੍ਯੈ ॥੩॥੯੮॥

ਚਾਚਰੀ ਛੰਦ ॥

ਨ ਸਤ੍ਰੈ ॥ ਨ ਮਿਤ੍ਰੈ ॥
ਨ ਭਰਮੰ ॥ ਨ ਭਿਤ੍ਰੈ ॥੧॥੯੯॥

ਨ ਕਰਮੰ ॥ ਨ ਕਾਏ ॥
ਅਜਨਮੰ ॥ ਅਜਾਏ ॥੨॥੧੦੦॥

ਨ ਚਿਤ੍ਰੈ ॥ ਨ ਮਿਤ੍ਰੈ ॥
ਪਰੇ ਹੈ ॥ ਪਵਿਤ੍ਰੈ ॥੩॥੧੦੧॥

ਪ੍ਰਿਥੀਸੈ ॥ ਅਦੀਸੈ ॥
ਅਦ੍ਰਿਸੈ ॥ ਅਕ੍ਰਿਸੈ ॥੪॥੧੦੨॥

ਭਗਵਤੀ ਛੰਦ ॥ ਤ੍ਵਪ੍ਰਸਾਦਿ ਕਥਤੇ ॥

ਕਿ ਆਛਿਜ ਦੇਸੈ ॥ ਕਿ ਆਭਿਜ ਭੇਸੈ ॥
ਕਿ ਆਗੰਜ ਕਰਮੈ ॥ ਕਿ ਆਭੰਜ ਭਰਮੈ ॥੧॥੧੦੩॥

ਕਿ ਆਭਿਜ ਲੋਕੈ ॥ ਕਿ ਆਦਿਤ ਸੋਕੈ ॥
ਕਿ ਅਵਧੂਤ ਬਰਨੈ ॥ ਕਿ ਬਿਭੂਤ ਕਰਨੈ ॥੨॥੧੦੪॥

ਕਿ ਰਾਜੰ ਪ੍ਰਭਾ ਹੈਂ ॥ ਕਿ ਧਰਮ ਧੁਜਾ ਹੈਂ ॥
ਕਿ ਆਸੋਕ ਬਰਨੈ ॥ ਕਿ ਸਰਬਾ ਅਭਰਨੈ ॥੩॥੧੦੫॥

ਕਿ ਜਗਤੰ ਕ੍ਰਿਤੀ ਹੈਂ ॥ ਕਿ ਛਤ੍ਰੰ ਛਤ੍ਰੀ ਹੈਂ ॥
ਕਿ ਬ੍ਰਹਮੰ ਸਰੂਪੈ ॥ ਕਿ ਅਨਭਉ ਅਨੂਪੈ ॥੪॥੧੦੬॥

ਕਿ ਆਦਿ ਅਦੇਵ ਹੈਂ ॥ ਕਿ ਆਪਿ ਅਭੇਵ ਹੈਂ ॥
ਕਿ ਚਿਤ੍ਰੰ ਬਿਹੀਨੈ ॥ ਕਿ ਏਕੈ ਅਧੀਨੈ ॥੫॥੧੦੭॥

ਕਿ ਰੋਜੀ ਰਜਾਕੈ ॥ ਰਹੀਮੈ ਰਿਹਾਕੈ ॥
ਕਿ ਪਾਕ ਬਿਐਬ ਹੈਂ ॥ ਕਿ ਗੈਬੁਲ ਗੈਬ ਹੈਂ ॥੬॥੧੦੮॥

ਕਿ ਅਫਵੁਲ ਗੁਨਾਹ ਹੈਂ ॥ ਕਿ ਸਾਹਾਨ ਸਾਹ ਹੈਂ ॥
ਕਿ ਕਾਰਨ ਕੁਨਿੰਦ ਹੈਂ ॥ ਕਿ ਰੋਜੀ ਦਿਹਿੰਦ ਹੈਂ ॥੭॥੧੦੯॥

ਕਿ ਰਾਜਕ ਰਹੀਮ ਹੈਂ ॥ ਕਿ ਕਰਮੰ ਕਰੀਮ ਹੈਂ ॥
ਕਿ ਸਰਬੰ ਕਲੀ ਹੈਂ ॥ ਕਿ ਸਰਬੰ ਦਲੀ ਹੈਂ ॥੮॥੧੧੦॥

ਕਿ ਸਰਬਤ੍ਰ ਮਾਨਿਯੈ ॥ ਕਿ ਸਰਬਤ੍ਰ ਦਾਨਿਯੈ ॥
ਕਿ ਸਰਬਤ੍ਰ ਗਉਨੈ ॥ ਕਿ ਸਰਬਤ੍ਰ ਭਉਨੈ ॥੯॥੧੧੧॥

ਕਿ ਸਰਬਤ੍ਰ ਦੇਸੈ ॥ ਕਿ ਸਰਬਤ੍ਰ ਭੇਸੈ ॥
ਕਿ ਸਰਬਤ੍ਰ ਰਾਜੈ ॥ਕਿ ਸਰਬਤ੍ਰ ਸਾਜੈ ॥੧੦॥੧੧੨॥

ਕਿ ਸਰਬਤ੍ਰ ਦੀਨੈ ॥ ਕਿ ਸਰਬਤ੍ਰ ਲੀਨੈ ॥
ਕਿ ਸਰਬਤ੍ਰ ਜਾਹੋ ॥ ਕਿ ਸਰਬਤ੍ਰ ਭਾਹੋ ॥੧੧॥੧੧੩॥

ਕਿ ਸਰਬਤ੍ਰ ਦੇਸੈ ॥ ਕਿ ਸਰਬਤ੍ਰ ਭੇਸੈ ॥
ਕਿ ਸਰਬਤ੍ਰ ਕਾਲੈ ॥ ਕਿ ਸਰਬਤ੍ਰ ਪਾਲੈ ॥੧੨॥੧੧੪॥

ਕਿ ਸਰਬਤ੍ਰ ਹੰਤਾ ॥ ਕਿ ਸਰਬਤ੍ਰ ਗੰਤਾ ॥
ਕਿ ਸਰਬਤ੍ਰ ਭੇਖੀ ॥ ਕਿ ਸਰਬਤ੍ਰ ਪੇਖੀ ॥੧੩॥੧੧੫॥

ਕਿ ਸਰਬਤ੍ਰ ਕਾਜੈ ॥ ਕਿ ਸਰਬਤ੍ਰ ਰਾਜੈ ॥
ਕਿ ਸਰਬਤ੍ਰ ਸੋਖੈ ॥ ਕਿ ਸਰਬਤ੍ਰ ਪੋਖੈ ॥੧੪॥੧੧੬॥

ਕਿ ਸਰਬਤ੍ਰ ਤ੍ਰਾਣੈ ॥ ਕਿ ਸਰਬਤ੍ਰ ਪ੍ਰਾਣੈ ॥
ਕਿ ਸਰਬਤ੍ਰ ਦੇਸੈ ॥ ਕਿ ਸਰਬਤ੍ਰ ਭੇਸੈ ॥੧੫॥੧੧੭॥

ਕਿ ਸਰਬਤ੍ਰ ਮਾਨਿਯੈ ॥ ਸਦੈਵੰ ਪ੍ਰਧਾਨਿਯੈ ॥
ਕਿ ਸਰਬਤ੍ਰ ਜਾਪਿਯੈ ॥ ਕਿ ਸਰਬਤ੍ਰ ਥਾਪਿਯੈ ॥੧੬॥੧੧੮॥

ਕਿ ਸਰਬਤ੍ਰ ਭਾਨੈ ॥ ਕਿ ਸਰਬਤ੍ਰ ਮਾਨੈ ॥
ਕਿ ਸਰਬਤ੍ਰ ਇੰਦ੍ਰੈ ॥ ਕਿ ਸਰਬਤ੍ਰ ਚੰਦ੍ਰੈ ॥੧੭॥੧੧੯॥

ਕਿ ਸਰਬੰ ਕਲੀਮੈ ॥ ਕਿ ਪਰਮੰ ਫਹੀਮੈ ॥
ਕਿ ਆਕਿਲ ਅਲਾਮੈ ॥ ਕਿ ਸਾਹਿਬ ਕਲਾਮੈ ॥੧੮॥੧੨੦॥

ਕਿ ਹੁਸਨਲ ਵਜੂ ਹੈਂ ॥ ਤਮਾਮੁਲ ਰੁਜੂ ਹੈਂ ॥
ਹਮੇਸੁਲ ਸਲਾਮੈ ॥ ਸਲੀਖਤ ਮੁਦਾਮੈ ॥੧੯॥੧੨੧॥

ਗਨੀਮੁਲ ਸਿਕਸਤੈ ॥ਗਰੀਬੁਲ ਪਰਸਤੈ ॥
ਬਿਲੰਦੁਲ ਮਕਾਨੈ ॥ ਜਮੀਨਲ ਜਮਾਨੈ ॥੨੦॥੧੨੨॥

ਤਮੀਜੁਲ ਤਮਾਮੈ ॥ ਰੁਜੂਅਲ ਨਿਧਾਨੈ ॥
ਹਰੀਫੁਲ ਅਜੀਮੈ ॥ਰਜਾਇਕ ਯਕੀਨੈ ॥੨੧॥੧੨੩॥

ਅਨੇਕੁਲ ਤਰੰਗ ਹੈਂ ॥ ਅਭੇਦ ਹੈਂ ਅਭੰਗ ਹੈਂ ॥
ਅਜੀਜਲ ਨਿਵਾਜ ਹੈਂ ॥ਗਨੀਮੁਲ ਖਿਰਾਜ ਹੈਂ ॥੨੨॥੧੨੪॥

ਨਿਰੁਕਤ ਸਰੂਪ ਹੈਂ ॥ ਤ੍ਰਿਮੁਕਤਿ ਬਿਭੂਤਿ ਹੈਂ ॥
ਪ੍ਰਭੁਗਤਿ ਪ੍ਰਭਾ ਹੈਂ ॥ ਸੁਜੁਗਤਿ ਸੁਧਾ ਹੈਂ ॥੨੩॥੧੨੫॥

ਸਦੈਵੰ ਸਰੂਪ ਹੈਂ ॥ ਅਭੇਦੀ ਅਨੂਪ ਹੈਂ ॥
ਸਮਸਤੋਪਰਾਜ ਹੈਂ ॥ ਸਦਾ ਸਰਬ ਸਾਜ ਹੈਂ ॥੨੪॥੧੨੬॥

ਸਮਸਤੁਲ ਸਲਾਮ ਹੈਂ ॥ ਸਦੈਵੁਲ ਅਕਾਮ ਹੈਂ ॥
ਨ੍ਰਿਬਾਧ ਸਰੂਪ ਹੈਂ ॥ਅਗਾਧ ਅਨੂਪ ਹੈਂ ॥੨੫॥੧੨੭॥

ਓਅੰ ਆਦਿ ਰੂਪੇ ॥ ਅਨਾਦਿ ਸਰੂਪੇ ॥
ਅਨੰਗੀ ਅਨਾਮੇ ॥ ਤ੍ਰਿਭੰਗੀ ਤ੍ਰਿਕਾਮੇ ॥੨੬॥੧੨੮॥

ਤ੍ਰਿਬਰਗੰ ਤ੍ਰਿਬਾਧੇ ॥ ਅਗੰਜੇ ਅਗਾਧੇ ॥
ਸੁਭੰ ਸਰਬ ਭਾਗੇ ॥ ਸੁ ਸਰਬਾਨੁਰਾਗੇ ॥੨੭॥੧੨੯॥

ਤ੍ਰਿਭੁਗਤ ਸਰੂਪ ਹੈਂ ॥ ਅਛਿਜ ਹੈਂ ਅਛੂਤ ਹੈਂ ॥
ਕਿ ਨਰਕੰ ਪ੍ਰਣਾਸ ਹੈਂ ॥ ਪ੍ਰਿਥੀਉਲ ਪ੍ਰਵਾਸ ਹੈਂ ॥੨੮॥੧੩੦॥

ਨਿਰੁਕਤਿ ਪ੍ਰਭਾ ਹੈਂ ॥ ਸਦੈਵੰ ਸਦਾ ਹੈਂ ॥
ਬਿਭੁਗਤਿ ਸਰੂਪ ਹੈਂ ॥ ਪ੍ਰਜੁਗਤਿ ਅਨੂਪ ਹੈਂ ॥੨੯॥੧੩੧॥

ਨਿਰੁਕਤਿ ਸਦਾ ਹੈਂ ॥ ਬਿਭੁਗਤਿ ਪ੍ਰਭਾ ਹੈਂ ॥
ਅਨਉਕਤਿ ਸਰੂਪ ਹੈਂ ॥ ਪ੍ਰਜੁਗਤਿ ਅਨੂਪ ਹੈਂ ॥੩੦॥੧੩੨॥

ਚਾਚਰੀ ਛੰਦ ॥ ਅਭੰਗ ਹੈਂ ॥
ਅਨੰਗ ਹੈਂ ॥ ਅਭੇਖ ਹੈਂ ॥ ਅਲੇਖ ਹੈਂ ॥੧॥੧੩੩॥

ਅਭਰਮ ਹੈਂ ॥ ਅਕਰਮ ਹੈਂ ॥
ਅਨਾਦਿ ਹੈਂ ॥ ਜੁਗਾਦਿ ਹੈਂ ॥੨॥੧੩੪॥

ਅਜੈ ਹੈਂ ॥ ਅਬੈ ਹੈਂ ॥
ਅਭੂਤ ਹੈਂ ॥ ਅਧੂਤ ਹੈਂ ॥੩॥੧੩੫॥

ਅਨਾਸ ਹੈਂ ॥ ਉਦਾਸ ਹੈਂ ॥
ਅਧੰਧ ਹੈਂ ॥ ਅਬੰਧ ਹੈਂ ॥੪॥੧੩੬॥

ਅਭਗਤ ਹੈਂ ॥ ਬਿਰਕਤ ਹੈਂ ॥
ਅਨਾਸ ਹੈਂ ॥ ਪ੍ਰਕਾਸ ਹੈਂ ॥੫॥੧੩੭॥

ਨਿਚਿੰਤ ਹੈਂ ॥ ਸੁਨਿੰਤ ਹੈਂ ॥
ਅਲਿਖ ਹੈਂ ॥ ਅਦਿਖ ਹੈਂ ॥੬॥੧੩੮॥

ਅਲੇਖ ਹੈਂ ॥ ਅਭੇਖ ਹੈਂ ॥
ਅਢਾਹ ਹੈਂ ॥ਅਗਾਹ ਹੈਂ ॥੭॥੧੩੯॥

ਅਸੰਭ ਹੈਂ ॥ ਅਗੰਭ ਹੈਂ ॥
ਅਨੀਲ ਹੈਂ ॥ ਅਨਾਦਿ ਹੈਂ ॥੮॥੧੪੦॥

ਅਨਿਤ ਹੈਂ ॥ਸੁਨਿਤ ਹੈਂ ॥
ਅਜਾਤ ਹੈਂ ॥ ਅਜਾਦਿ ਹੈਂ ॥੯॥੧੪੧॥

ਚਰਪਟ ਛੰਦ ॥ ਤ੍ਵਪ੍ਰਸਾਦਿ ॥
ਸਰਬੰ ਹੰਤਾ ॥ਸਰਬੰ ਗੰਤਾ ॥
ਸਰਬੰ ਖਿਆਤਾ ॥
ਸਰਬੰ ਗਿਆਤਾ ॥੧॥੧੪੨॥

ਸਰਬੰ ਹਰਤਾ ॥ ਸਰਬੰ ਕਰਤਾ ॥
ਸਰਬੰ ਪ੍ਰਾਣੰ ॥ ਸਰਬੰ ਤ੍ਰਾਣੰ ॥੨॥੧੪੩॥

ਸਰਬੰ ਕਰਮੰ ॥ ਸਰਬੰ ਧਰਮੰ ॥
ਸਰਬੰ ਜੁਗਤਾ ॥ ਸਰਬੰ ਮੁਕਤਾ ॥੩॥੧੪੪॥

ਰਸਾਵਲ ਛੰਦ ॥ ਤ੍ਵਪ੍ਰਸਾਦਿ ॥
ਨਮੋ ਨਰਕ ਨਾਸੇ ॥ ਸਦੈਵੰ ਪ੍ਰਕਾਸੇ ॥
ਅਨੰਗੰ ਸਰੂਪੇ ॥ ਅਭੰਗੰ ਬਿਭੂਤੇ ॥੧॥੧੪੫॥

ਪ੍ਰਮਾਥੰ ਪ੍ਰਮਾਥੇ ॥ ਸਦਾ ਸਰਬ ਸਾਥੇ ॥
ਅਗਾਧ ਸਰੂਪੇ ॥ ਨ੍ਰਿਬਾਧ ਬਿਭੂਤੇ ॥੨॥੧੪੬॥

ਅਨੰਗੀ ਅਨਾਮੇ ॥ ਤ੍ਰਿਭੰਗੀ ਤ੍ਰਿਕਾਮੇ ॥
ਨ੍ਰਿਭੰਗੀ ਸਰੂਪੇ ॥ਸਰਬੰਗੀ ਅਨੂਪੇ ॥੩॥੧੪੭॥

ਨ ਪੋਤ੍ਰੈ ਨ ਪੁਤ੍ਰੈ ॥ ਨ ਸਤ੍ਰੈ ਨ ਮਿਤ੍ਰੈ ॥
ਨ ਤਾਤੈ ਨ ਮਾਤੈ ॥ ਨ ਜਾਤੈ ਨ ਪਾਤੈ ॥੪॥੧੪੮॥

ਨ੍ਰਿਸਾਕੰ ਸਰੀਕ ਹੈਂ ॥ ਅਮਿਤੋ ਅਮੀਕ ਹੈਂ ॥
ਸਦੈਵੰ ਪ੍ਰਭਾ ਹੈਂ ॥ ਅਜੈ ਹੈਂ ਅਜਾ ਹੈਂ ॥੫॥੧੪੯॥

ਭਗਵਤੀ ਛੰਦ ॥ ਤ੍ਵਪ੍ਰਸਾਦਿ ॥
ਕਿ ਜਾਹਿਰ ਜਹੂਰ ਹੈਂ ॥ ਕਿ ਹਾਜਿਰ ਹਜੂਰ ਹੈਂ ॥
ਹਮੇਸੁਲ ਸਲਾਮ ਹੈਂ ॥ ਸਮਸਤੁਲ ਕਲਾਮ ਹੈਂ ॥੧॥੧੫੦॥

ਕਿ ਸਾਹਿਬ ਦਿਮਾਗ ਹੈਂ ॥ ਕਿ ਹੁਸਨੁਲ ਚਰਾਗ ਹੈਂ ॥
ਕਿ ਕਾਮਲ ਕਰੀਮ ਹੈਂ ॥ ਕਿ ਰਾਜਕ ਰਹੀਮ ਹੈਂ ॥੨॥੧੫੧॥

ਕਿ ਰੋਜੀ ਦਿਹਿੰਦ ਹੈਂ ॥ ਕਿ ਰਾਜਕ ਰਹਿੰਦ ਹੈਂ ॥
ਕਰੀਮੁਲ ਕਮਾਲ ਹੈਂ ॥ ਕਿ ਹੁਸਨੁਲ ਜਮਾਲ ਹੈਂ ॥੩॥੧੫੨॥

ਗਨੀਮੁਲ ਖਿਰਾਜ ਹੈਂ ॥ ਗਰੀਬੁਲ ਨਿਵਾਜ ਹੈਂ ॥
ਹਰੀਫੁਲ ਸਿਕੰਨ ਹੈਂ ॥ ਹਿਰਾਸੁਲ ਫਿਕੰਨ ਹੈਂ ॥੪॥੧੫੩॥

ਕਲੰਕੰ ਪ੍ਰਣਾਸ ਹੈਂ ॥ ਸਮਸਤੁਲ ਨਿਵਾਸ ਹੈਂ ॥
ਅਗੰਜੁਲ ਗਨੀਮ ਹੈਂ ॥ ਰਜਾਇਕ ਰਹੀਮ ਹੈ ॥੫॥੧੫੪॥

ਸਮਸਤੁਲ ਜੁਬਾਂ ਹੈਂ ॥ ਕਿ ਸਾਹਿਬ ਕਿਰਾ ਹੈਂ ॥
ਕਿ ਨਰਕੰ ਪ੍ਰਣਾਸ ਹੈਂ ॥ ਬਹਿਸਤੁਲ ਨਿਵਾਸ ਹੈਂ ॥੬॥੧੫੫॥

ਕਿ ਸਰਬੁਲ ਗਵੰਨ ਹੈਂ ॥ ਹਮੇਸੁਲ ਰਵੰਨ ਹੈ ॥
ਤਮਾਮੁਲ ਤਮੀਜ ਹੈਂ ॥ ਸਮਸਤੁਲ ਅਜੀਜ ਹੈਂ ॥੭॥੧੫੬॥

ਪਰੰ ਪਰਮ ਈਸ ਹੈਂ ॥ ਸਮਸਤੁਲ ਅਦੀਸ ਹੈਂ ॥
ਅਦੇਸੁਲ ਅਲੇਖ ਹੈਂ ॥ ਹਮੇਸੁਲ ਅਭੇਖ ਹੈਂ ॥੮॥੧੫੭॥

ਜਮੀਨੁਲ ਜਮਾਂ ਹੈਂ ॥ ਅਮੀਕੁਲ ਇਮਾਂ ਹੈਂ ॥
ਕਰੀਮੁਲ ਕਮਾਲ ਹੈਂ ॥ ਕਿ ਜੁਰਅਤ ਜਮਾਲ ਹੈਂ ॥੯॥੧੫੮॥

ਕਿ ਅਚਲੰ ਪ੍ਰਕਾਸ ਹੈਂ ॥ ਕਿ ਅਮਿਤੋ ਸੁਬਾਸ ਹੈਂ ॥
ਕਿ ਅਜਬ ਸਰੂਪ ਹੈਂ ॥ ਕਿ ਅਮਿਤੋ ਬਿਭੂਤਿ ਹੈਂ ॥੧੦॥੧੫੯॥

ਕਿ ਅਮਿਤੋ ਪਸਾ ਹੈਂ ॥ ਕਿ ਆਤਮ ਪ੍ਰਭਾ ਹੈਂ ॥
ਕਿ ਅਚਲੰ ਅਨੰਗ ਹੈਂ ॥ ਕਿ ਅਮਿਤੋ ਅਭੰਗ ਹੈਂ ॥੧੧॥੧੬੦॥

ਮਧੁਭਾਰ ਛੰਦ ॥ ਤ੍ਵਪ੍ਰਸਾਦਿ ॥

ਮੁਨਿ ਮਨਿ ਪ੍ਰਨਾਮ ॥ਗੁਨਿ ਗਨ ਮੁਦਾਮ ॥
ਅਰਿ ਬਰ ਅਗੰਜ ॥ ਹਰਿ ਨਰ ਪ੍ਰਭੰਜ ॥੧॥੧੬੧॥

ਅਨ ਗਨ ਪ੍ਰਨਾਮ ॥ ਮੁਨਿ ਮਨਿ ਸਲਾਮ ॥
ਹਰਿ ਨਰ ਅਖੰਡ ॥ਬਰ ਨਰ ਅਮੰਡ ॥੨॥੧੬੨॥

ਅਨਭਵ ਅਨਾਸ ॥ ਮੁਨਿ ਮਨਿ ਪ੍ਰਕਾਸ ॥
ਗੁਨਿ ਗਨ ਪ੍ਰਨਾਮ ॥ ਜਲ ਥਲ ਮੁਦਾਮ ॥੩॥੧੬੩॥

ਅਨਛਿਜ ਅੰਗ ॥ ਆਸਨ ਅਭੰਗ ॥
ਉਪਮਾ ਅਪਾਰ ॥ ਗਤਿ ਮਿਤਿ ਉਦਾਰ ॥੪॥੧੬੪॥

ਜਲ ਥਲ ਅਮੰਡ ॥ਦਿਸ ਵਿਸ ਅਭੰਡ ॥
ਜਲ ਥਲ ਮਹੰਤ ॥ਦਿਸ ਵਿਸ ਬਿਅੰਤ ॥੫॥੧੬੫॥

ਅਨਭਵ ਅਨਾਸ ॥ ਧ੍ਰਿਤ ਧਰ ਧੁਰਾਸ ॥
ਆਜਾਨ ਬਾਹੁ ॥ ਏਕੈ ਸਦਾਹੁ ॥੬॥੧੬੬॥

ਓਅੰਕਾਰ ਆਦਿ ॥ ਕਥਨੀ ਅਨਾਦਿ ॥
ਖਲ ਖੰਡ ਖਿਆਲ ॥ ਗੁਰ ਬਰ ਅਕਾਲ ॥੭॥੧੬੭॥

ਘਰਿ ਘਰਿ ਪ੍ਰਨਾਮ ॥ ਚਿਤ ਚਰਨ ਨਾਮ ॥
ਅਨਛਿਜ ਗਾਤ ॥ ਆਜਿਜ ਨ ਬਾਤ ॥੮॥੧੬੮॥

ਅਨਝੰਝ ਗਾਤ ॥ ਅਨਰੰਜ ਬਾਤ ॥
ਅਨਟੁਟ ਭੰਡਾਰ ॥ ਅਨਠਟ ਅਪਾਰ ॥੯॥੧੬੯॥

ਆਡੀਠ ਧਰਮ ॥ ਅਤਿ ਢੀਠ ਕਰਮ ॥
ਅਨਬ੍ਰਣ ਅਨੰਤ ॥ ਦਾਤਾ ਮਹੰਤ ॥੧੦॥੧੭੦॥

ਹਰਿਬੋਲਮਨਾ ਛੰਦ ॥ ਤ੍ਵਪ੍ਰਸਾਦਿ ॥

ਕਰੁਣਾਲਯ ਹੈਂ ॥ ਅਰਿ ਘਾਲਯ ਹੈਂ ॥
ਖਲ ਖੰਡਨ ਹੈਂ ॥ਮਹਿ ਮੰਡਨ ਹੈਂ ॥੧॥੧੭੧॥

ਜਗਤੇਸ੍ਵਰ ਹੈਂ ॥ ਪਰਮੇਸ੍ਵਰ ਹੈਂ ॥
ਕਲਿ ਕਾਰਣ ਹੈਂ ॥ ਸਰਬ ਉਬਾਰਣ ਹੈਂ ॥੨॥੧੭੨॥

ਧ੍ਰਿਤ ਕੇ ਧਰਣ ਹੈਂ ॥ ਜਗ ਕੇ ਕਰਣ ਹੈਂ ॥
ਮਨ ਮਾਨਿਯ ਹੈਂ ॥ਜਗ ਜਾਨਿਯ ਹੈਂ ॥੩॥੧੭੩॥

ਸਰਬੰ ਭਰ ਹੈਂ ॥ ਸਰਬੰ ਕਰ ਹੈਂ ॥
ਸਰਬ ਪਾਸਿਯ ਹੈਂ ॥ ਸਰਬ ਨਾਸਿਯ ਹੈਂ ॥੪॥੧੭੪॥

ਕਰੁਣਾਕਰ ਹੈਂ ॥ ਬਿਸ੍ਵੰਭਰ ਹੈਂ ॥
ਸਰਬੇਸ੍ਵਰ ਹੈਂ ॥ ਜਗਤੇਸ੍ਵਰ ਹੈਂ ॥੫॥੧੭੫॥

ਬ੍ਰਹਮੰਡਸ ਹੈਂ ॥ ਖਲ ਖੰਡਸ ਹੈਂ ॥
ਪਰ ਤੇ ਪਰ ਹੈਂ ॥ ਕਰੁਣਾਕਰ ਹੈਂ ॥੬॥੧੭੬॥

ਅਜਪਾ ਜਪ ਹੈਂ ॥ ਅਥਪਾ ਥਪ ਹੈਂ ॥
ਅਕ੍ਰਿਤਾ ਕ੍ਰਿਤ ਹੈਂ ॥ ਅਮ੍ਰਿਤਾ ਮ੍ਰਿਤ ਹੈਂ ॥੭॥੧੭੭॥

ਅਮ੍ਰਿਤਾ ਮ੍ਰਿਤ ਹੈਂ ॥ ਕਰੁਣਾ ਕ੍ਰਿਤ ਹੈਂ ॥
ਅਕ੍ਰਿਤਾ ਕ੍ਰਿਤ ਹੈਂ ॥ ਧਰਣੀ ਧ੍ਰਿਤ ਹੈਂ ॥੮॥੧੭੮॥

ਅਮਿਤੇਸ੍ਵਰ ਹੈਂ ॥ ਪਰਮੇਸ੍ਵਰ ਹੈਂ ॥
ਅਕ੍ਰਿਤਾ ਕ੍ਰਿਤ ਹੈਂ ॥ ਅਮ੍ਰਿਤਾ ਮ੍ਰਿਤ ਹੈਂ ॥੯॥੧੭੯॥

ਅਜਬਾ ਕ੍ਰਿਤ ਹੈਂ ॥ ਅਮ੍ਰਿਤਾ ਮ੍ਰਿਤ ਹੈਂ ॥
ਨਰ ਨਾਇਕ ਹੈਂ ॥ ਖਲ ਘਾਇਕ ਹੈਂ ॥੧੦॥੧੮੦॥

ਬਿਸ੍ਵੰਭਰ ਹੈਂ ॥ ਕਰੁਣਾਲਯ ਹੈਂ ॥
ਨ੍ਰਿਪ ਨਾਇਕ ਹੈਂ ॥ ਸਰਬ ਪਾਇਕ ਹੈਂ ॥੧੧॥੧੮੧॥

ਭਵ ਭੰਜਨ ਹੈਂ ॥ ਅਰਿ ਗੰਜਨ ਹੈਂ ॥
ਰਿਪੁ ਤਾਪਨ ਹੈਂ ॥ ਜਪੁ ਜਾਪਨ ਹੈਂ ॥੧੨॥੧੮੨॥

ਅਕਲੰਕ੍ਰਿਤ ਹੈਂ ॥ ਸਰਬਾ ਕ੍ਰਿਤ ਹੈਂ ॥
ਕਰਤਾ ਕਰ ਹੈਂ ॥ ਹਰਤਾ ਹਰਿ ਹੈਂ ॥੧੩॥੧੮੩॥

ਪਰਮਾਤਮ ਹੈਂ ॥ ਸਰਬਾਤਮ ਹੈਂ ॥
ਆਤਮ ਬਸ ਹੈਂ ॥ਜਸ ਕੇ ਜਸ ਹੈਂ ॥੧੪॥੧੮੪॥

ਭੁਜੰਗ ਪ੍ਰਯਾਤ ਛੰਦ ॥
ਨਮੋ ਸੂਰਜ ਸੂਰਜੇ ਨਮੋ ਚੰਦ੍ਰ ਚੰਦ੍ਰੇ ॥
ਨਮੋ ਰਾਜ ਰਾਜੇ ਨਮੋ ਇੰਦ੍ਰ ਇੰਦ੍ਰੇ ॥
ਨਮੋ ਅੰਧਕਾਰੇ ਨਮੋ ਤੇਜ ਤੇਜੇ ॥
ਨਮੋ ਬ੍ਰਿੰਦ ਬ੍ਰਿੰਦੇ ਨਮੋ ਬੀਜ ਬੀਜੇ ॥੧॥੧੮੫॥

ਨਮੋ ਰਾਜਸੰ ਤਾਮਸੰ ਸਾਂਤਿ ਰੂਪੇ ॥
ਨਮੋ ਪਰਮ ਤਤੰ ਅਤਤੰ ਸਰੂਪੇ ॥
ਨਮੋ ਜੋਗ ਜੋਗੇ ਨਮੋ ਗਿਆਨ ਗਿਆਨੇ ॥
ਨਮੋ ਮੰਤ੍ਰ ਮੰਤ੍ਰੇ ਨਮੋ ਧਿਆਨ ਧਿਆਨੇ ॥੨॥੧੮੬॥

ਨਮੋ ਜੁਧ ਜੁਧੇ ਨਮੋ ਗਿਆਨੇ ਗਿਆਨੇ ॥
ਨਮੋ ਭੋਜ ਭੋਜੇ ਨਮੋ ਪਾਨ ਪਾਨੇ ॥
ਨਮੋ ਕਲਹ ਕਰਤਾ ਨਮੋ ਸਾਂਤਿ ਰੂਪੇ ॥
ਨਮੋ ਇੰਦ੍ਰ ਇੰਦ੍ਰੇ ਅਨਾਦੰ ਬਿਭੂਤੇ ॥੩॥੧੮੭॥

ਕਲੰਕਾਰ ਰੂਪੇ ਅਲੰਕਾਰ ਅਲੰਕੇ ॥
ਨਮੋ ਆਸ ਆਸੇ ਨਮੋ ਬਾਕ ਬੰਕੇ ॥
ਅਭੰਗੀ ਸਰੂਪੇ ਅਨੰਗੀ ਅਨਾਮੇ ॥
ਤ੍ਰਿਭੰਗੀ ਤ੍ਰਿਕਾਲੇ ਅਨੰਗੀ ਅਕਾਮੇ ॥੪॥੧੮੮॥

ਏਕ ਅਛਰੀ ਛੰਦ ॥

ਅਜੈ ॥ ਅਲੈ ॥
ਅਭੈ ॥ ਅਬੈ ॥੧॥੧੮੯॥

ਅਭੂ ॥ ਅਜੂ ॥
ਅਨਾਸ ॥ ਅਕਾਸ ॥੨॥੧੯੦॥

ਅਗੰਜ ॥ ਅਭੰਜ ॥
ਅਲਖ ॥ ਅਭਖ ॥੩॥੧੯੧॥

ਅਕਾਲ ॥ ਦਿਆਲ ॥
ਅਲੇਖ ॥ ਅਭੇਖ ॥੪॥੧੯੨॥

ਅਨਾਮ ॥ ਅਕਾਮ ॥
ਅਗਾਹ ॥ ਅਢਾਹ ॥੫॥੧੯੩॥

ਅਨਾਥੇ ॥ ਪ੍ਰਮਾਥੇ ॥
ਅਜੋਨੀ ॥ ਅਮੋਨੀ ॥੬॥੧੯੪॥

ਨ ਰਾਗੇ ॥ ਨ ਰੰਗੇ ॥
ਨ ਰੂਪੇ ॥ ਨ ਰੇਖੇ ॥੭॥੧੯੫॥

ਅਕਰਮੰ ॥ ਅਭਰਮੰ ॥
ਅਗੰਜੇ ॥ਅਲੇਖੇ ॥੮॥੧੯੬॥

ਭੁਜੰਗ ਪ੍ਰਯਾਤ ਛੰਦ ॥

ਨਮਸਤੁਲ ਪ੍ਰਨਾਮੇ ਸਮਸਤੁਲ ਪ੍ਰਣਾਸੇ ॥
ਅਗੰਜੁਲ ਅਨਾਮੇ ਸਮਸਤੁਲ ਨਿਵਾਸੇ ॥
ਨਿਰਕਾਮੰ ਬਿਭੂਤੇ ਸਮਸਤੁਲ ਸਰੂਪੇ ॥
ਕੁਕਰਮੰ ਪ੍ਰਣਾਸੀ ਸੁਧਰਮੰ ਬਿਭੂਤੇ ॥੧॥੧੯੭॥

ਸਦਾ ਸਚਿਦਾਨੰਦ ਸਤ੍ਰੰ ਪ੍ਰਣਾਸੀ ॥
ਕਰੀਮੁਲ ਕੁਨਿੰਦਾ ਸਮਸਤੁਲ ਨਿਵਾਸੀ ॥
ਅਜਾਇਬ ਬਿਭੂਤੇ ਗਜਾਇਬ ਗਨੀਮੇ ॥
ਹਰੀਅੰ ਕਰੀਅੰ ਕਰੀਮਲੁ ਰਹੀਮੇ ॥੨॥੧੯੮॥

ਚਤ੍ਰ ਚਕ੍ਰ ਵਰਤੀ ਚਤ੍ਰ ਚਕ੍ਰ ਭੁਗਤੇ ॥
ਸੁਯੰਭਵ ਸੁਭੰ ਸਰਬਦਾ ਸਰਬ ਜੁਗਤੇ ॥
ਦੁਕਾਲੰ ਪ੍ਰਣਾਸੀ ਦਿਆਲੰ ਸਰੂਪੇ ॥
ਸਦਾ ਅੰਗ ਸੰਗੇ ਅਭੰਗੰ ਬਿਭੂਤੇ ॥੩॥੧੯੯॥
""",

  "Chaupai Sahib": """
ਕਬ੍ਯੋ ਬਾਚ ਬੇਨਤੀ ॥

ਚੌਪਈ ॥

ਹਮਰੀ ਕਰੋ ਹਾਥ ਦੈ ਰਛਾ ॥
ਪੂਰਨ ਹੋਇ ਚਿਤ ਕੀ ਇਛਾ ॥
ਤਵ ਚਰਨਨ ਮਨ ਰਹੈ ਹਮਾਰਾ ॥
ਅਪਨਾ ਜਾਨ ਕਰੋ ਪ੍ਰਤਿਪਾਰਾ ॥੩੭੭॥

ਹਮਰੇ ਦੁਸਟ ਸਭੈ ਤੁਮ ਘਾਵਹੁ ॥
ਆਪੁ ਹਾਥ ਦੈ ਮੋਹਿ ਬਚਾਵਹੁ ॥
ਸੁਖੀ ਬਸੈ ਮੋਰੋ ਪਰਿਵਾਰਾ ॥
ਸੇਵਕ ਸਿਖ੍ਯ ਸਭੈ ਕਰਤਾਰਾ ॥੩੭੮॥

ਮੋ ਰਛਾ ਨਿਜੁ ਕਰ ਦੈ ਕਰਿਯੈ ॥
ਸਭ ਬੈਰਿਨ ਕੌ ਆਜ ਸੰਘਰਿਯੈ ॥
ਪੂਰਨ ਹੋਇ ਹਮਾਰੀ ਆਸਾ ॥
ਤੋਰਿ ਭਜਨ ਕੀ ਰਹੈ ਪਿਯਾਸਾ ॥੩੭੯॥

ਤੁਮਹਿ ਛਾਡਿ ਕੋਈ ਅਵਰ ਨ ਧ੍ਯਾਊ ॥
ਜੋ ਬਰ ਚਾਹੌ ਸੁ ਤੁਮ ਤੇ ਪਾਊ ॥
ਸੇਵਕ ਸਿਖ੍ਯ ਹਮਾਰੇ ਤਾਰਿਯਹਿ ॥
ਚੁਨ ਚੁਨ ਸਤ੍ਰੁ ਹਮਾਰੇ ਮਾਰਿਯਹਿ ॥੩੮੦॥

ਆਪੁ ਹਾਥ ਦੈ ਮੁਝੈ ਉਬਰਿਯੈ ॥
ਮਰਨ ਕਾਲ ਕਾ ਤ੍ਰਾਸ ਨਿਵਰਿਯੈ ॥
ਹੂਜੋ ਸਦਾ ਹਮਾਰੇ ਪਛਾ ॥
ਸ੍ਰੀ ਅਸਿਧੁਜ ਜੂ ਕਰਿਯਹੁ ਰਛਾ ॥੩੮੧॥

ਰਾਖਿ ਲੇਹੁ ਮੁਹਿ ਰਾਖਨਹਾਰੇ ॥
ਸਾਹਿਬ ਸੰਤ ਸਹਾਇ ਪਿਯਾਰੇ ॥
ਦੀਨਬੰਧੁ ਦੁਸਟਨ ਕੇ ਹੰਤਾ ॥
ਤੁਮ ਹੋ ਪੁਰੀ ਚਤੁਰਦਸ ਕੰਤਾ ॥੩੮੨॥

ਕਾਲ ਪਾਇ ਬ੍ਰਹਮਾ ਬਪੁ ਧਰਾ ॥
ਕਾਲ ਪਾਇ ਸਿਵ ਜੂ ਅਵਤਰਾ ॥
ਕਾਲ ਪਾਇ ਕਰਿ ਬਿਸਨ ਪ੍ਰਕਾਸਾ ॥
ਸਕਲ ਕਾਲ ਕਾ ਕੀਯਾ ਤਮਾਸਾ ॥੩੮੩॥

ਜਵਨ ਕਾਲ ਜੋਗੀ ਸਿਵ ਕੀਯੋ ॥
ਬੇਦ ਰਾਜ ਬ੍ਰਹਮਾ ਜੂ ਥੀਯੋ ॥
ਜਵਨ ਕਾਲ ਸਭ ਲੋਕ ਸਵਾਰਾ ॥
ਨਮਸਕਾਰ ਹੈ ਤਾਹਿ ਹਮਾਰਾ ॥੩੮੪॥

ਜਵਨ ਕਾਲ ਸਭ ਜਗਤ ਬਨਾਯੋ ॥
ਦੇਵ ਦੈਤ ਜਛਨ ਉਪਜਾਯੋ ॥
ਆਦਿ ਅੰਤਿ ਏਕੈ ਅਵਤਾਰਾ ॥
ਸੋਈ ਗੁਰੂ ਸਮਝਿਯਹੁ ਹਮਾਰਾ ॥੩੮੫॥

ਨਮਸਕਾਰ ਤਿਸ ਹੀ ਕੋ ਹਮਾਰੀ ॥
ਸਕਲ ਪ੍ਰਜਾ ਜਿਨ ਆਪ ਸਵਾਰੀ ॥
ਸਿਵਕਨ ਕੋ ਸਿਵਗੁਨ ਸੁਖ ਦੀਯੋ ॥
ਸਤ੍ਰੁਨ ਕੋ ਪਲ ਮੋ ਬਧ ਕੀਯੋ ॥੩੮੬॥

ਘਟ ਘਟ ਕੇ ਅੰਤਰ ਕੀ ਜਾਨਤ ॥
ਭਲੇ ਬੁਰੇ ਕੀ ਪੀਰ ਪਛਾਨਤ ॥
ਚੀਟੀ ਤੇ ਕੁੰਚਰ ਅਸਥੂਲਾ ॥
ਸਭ ਪਰ ਕ੍ਰਿਪਾ ਦ੍ਰਿਸਟਿ ਕਰਿ ਫੂਲਾ ॥੩੮੭॥

ਸੰਤਨ ਦੁਖ ਪਾਏ ਤੇ ਦੁਖੀ ॥
ਸੁਖ ਪਾਏ ਸਾਧਨ ਕੇ ਸੁਖੀ ॥
ਏਕ ਏਕ ਕੀ ਪੀਰ ਪਛਾਨੈ ॥
ਘਟ ਘਟ ਕੇ ਪਟ ਪਟ ਕੀ ਜਾਨੈ ॥੩੮੮॥

ਜਬ ਉਦਕਰਖ ਕਰਾ ਕਰਤਾਰਾ ॥
ਪ੍ਰਜਾ ਧਰਤ ਤਬ ਦੇਹ ਅਪਾਰਾ ॥
ਜਬ ਆਕਰਖ ਕਰਤ ਹੋ ਕਬਹੂੰ ॥
ਤੁਮ ਮੈ ਮਿਲਤ ਦੇਹ ਧਰ ਸਭਹੂੰ ॥੩੮੯॥

ਜੇਤੇ ਬਦਨ ਸ੍ਰਿਸਟਿ ਸਭ ਧਾਰੈ ॥
ਆਪੁ ਆਪੁਨੀ ਬੂਝਿ ਉਚਾਰੈ ॥
ਤੁਮ ਸਭ ਹੀ ਤੇ ਰਹਤ ਨਿਰਾਲਮ ॥
ਜਾਨਤ ਬੇਦ ਭੇਦ ਅਰੁ ਆਲਮ ॥੩੯੦॥

ਨਿਰੰਕਾਰ ਨ੍ਰਿਬਿਕਾਰ ਨ੍ਰਿਲੰਭ ॥
ਆਦਿ ਅਨੀਲ ਅਨਾਦਿ ਅਸੰਭ ॥
ਤਾ ਕਾ ਮੂੜ ਉਚਾਰਤ ਭੇਦਾ ॥
ਜਾ ਕੋ ਭੇਵ ਨ ਪਾਵਤ ਬੇਦਾ ॥੩੯੧॥

ਤਾ ਕੌ ਕਰਿ ਪਾਹਨ ਅਨੁਮਾਨਤ ॥
ਮਹਾ ਮੂੜ ਕਛੁ ਭੇਦ ਨ ਜਾਨਤ ॥
ਮਹਾਦੇਵ ਕੌ ਕਹਤ ਸਦਾ ਸਿਵ ॥
ਨਿਰੰਕਾਰ ਕਾ ਚੀਨਤ ਨਹਿ ਭਿਵ ॥੩੯੨॥

ਆਪੁ ਆਪੁਨੀ ਬੁਧਿ ਹੈ ਜੇਤੀ ॥
ਬਰਨਤ ਭਿੰਨ ਭਿੰਨ ਤੁਹਿ ਤੇਤੀ ॥
ਤੁਮਰਾ ਲਖਾ ਨ ਜਾਇ ਪਸਾਰਾ ॥
ਕਿਹ ਬਿਧਿ ਸਜਾ ਪ੍ਰਥਮ ਸੰਸਾਰਾ ॥੩੯੩॥

ਏਕੈ ਰੂਪ ਅਨੂਪ ਸਰੂਪਾ ॥
ਰੰਕ ਭਯੋ ਰਾਵ ਕਹੀ ਭੂਪਾ ॥
ਅੰਡਜ ਜੇਰਜ ਸੇਤਜ ਕੀਨੀ ॥
ਉਤਭੁਜ ਖਾਨਿ ਬਹੁਰਿ ਰਚਿ ਦੀਨੀ ॥੩੯੪॥

ਕਹੂੰ ਫੂਲਿ ਰਾਜਾ ਹ੍ਵੈ ਬੈਠਾ ॥
ਕਹੂੰ ਸਿਮਟਿ ਭਯੋ ਸੰਕਰ ਇਕੈਠਾ ॥
ਸਗਰੀ ਸ੍ਰਿਸਟਿ ਦਿਖਾਇ ਅਚੰਭਵ ॥
ਆਦਿ ਜੁਗਾਦਿ ਸਰੂਪ ਸੁਯੰਭਵ ॥੩੯੫॥

ਅਬ ਰਛਾ ਮੇਰੀ ਤੁਮ ਕਰੋ ॥
ਸਿਖ੍ਯ ਉਬਾਰਿ ਅਸਿਖ੍ਯ ਸੰਘਰੋ ॥
ਦੁਸਟ ਜਿਤੇ ਉਠਵਤ ਉਤਪਾਤਾ ॥
ਸਕਲ ਮਲੇਛ ਕਰੋ ਰਣ ਘਾਤਾ ॥੩੯੬॥

ਜੇ ਅਸਿਧੁਜ ਤਵ ਸਰਨੀ ਪਰੇ ॥
ਤਿਨ ਕੇ ਦੁਸਟ ਦੁਖਿਤ ਹ੍ਵੈ ਮਰੇ ॥
ਪੁਰਖ ਜਵਨ ਪਗੁ ਪਰੇ ਤਿਹਾਰੇ ॥
ਤਿਨ ਕੇ ਤੁਮ ਸੰਕਟ ਸਭ ਟਾਰੇ ॥੩੯੭॥

ਜੋ ਕਲਿ ਕੌ ਇਕ ਬਾਰ ਧਿਐਹੈ ॥
ਤਾ ਕੇ ਕਾਲ ਨਿਕਟਿ ਨਹਿ ਐਹੈ ॥
ਰਛਾ ਹੋਇ ਤਾਹਿ ਸਭ ਕਾਲਾ ॥
ਦੁਸਟ ਅਰਿਸਟ ਟਰੈਂ ਤਤਕਾਲਾ ॥੩੯੮॥

ਕ੍ਰਿਪਾ ਦ੍ਰਿਸਟਿ ਤਨ ਜਾਹਿ ਨਿਹਰਿਹੋ ॥
ਤਾ ਕੇ ਤਾਪ ਤਨਕ ਮਹਿ ਹਰਿਹੋ ॥
ਰਿਧਿ ਸਿਧਿ ਘਰ ਮੋ ਸਭ ਹੋਈ ॥
ਦੁਸਟ ਛਾਹ ਛ੍ਵੈ ਸਕੈ ਨ ਕੋਈ ॥੩੯੯॥

ਏਕ ਬਾਰ ਜਿਨ ਤੁਮੈ ਸੰਭਾਰਾ ॥
ਕਾਲ ਫਾਸ ਤੇ ਤਾਹਿ ਉਬਾਰਾ ॥
ਜਿਨ ਨਰ ਨਾਮ ਤਿਹਾਰੋ ਕਹਾ ॥
ਦਾਰਿਦ ਦੁਸਟ ਦੋਖ ਤੇ ਰਹਾ ॥੪੦੦॥

ਖੜਗਕੇਤੁ ਮੈ ਸਰਨਿ ਤਿਹਾਰੀ ॥
ਆਪੁ ਹਾਥ ਦੈ ਲੇਹੁ ਉਬਾਰੀ ॥
ਸਰਬ ਠੌਰ ਮੋ ਹੋਹੁ ਸਹਾਈ ॥
ਦੁਸਟ ਦੋਖ ਤੇ ਲੇਹੁ ਬਚਾਈ ॥੪੦੧॥
...
""",

  

















































































































































































































































































  "Rehras Sahib/ਰਹਿਰਾਸ ਸਾਹਿਬ": """
ਹਰਿ ਜੁਗੁ ਜੁਗੁ ਭਗਤ ਉਪਾਇਆ ਪੈਜ ਰਖਦਾ ਆਇਆ ਰਾਮ ਰਾਜੇ ॥
ਹਰਣਾਖਸੁ ਦੁਸਟੁ ਹਰਿ ਮਾਰਿਆ ਪ੍ਰਹਲਾਦੁ ਤਰਾਇਆ ॥
ਅਹੰਕਾਰੀਆ ਨਿੰਦਕਾ ਪਿਠਿ ਦੇਇ ਨਾਮਦੇਉ ਮੁਖਿ ਲਾਇਆ ॥
ਜਨ ਨਾਨਕ ਐਸਾ ਹਰਿ ਸੇਵਿਆ ਅੰਤਿ ਲਏ ਛਡਾਇਆ ॥੪॥੧੩॥੨੦॥

ਸਲੋਕੁ ਮਃ ੧ ॥
ਦੁਖੁ ਦਾਰੂ ਸੁਖੁ ਰੋਗੁ ਭਇਆ ਜਾ ਸੁਖੁ ਤਾਮਿ ਨ ਹੋਈ ॥
ਤੂੰ ਕਰਤਾ ਕਰਣਾ ਮੈ ਨਾਹੀ ਜਾ ਹਉ ਕਰੀ ਨ ਹੋਈ ॥੧॥

ਬਲਿਹਾਰੀ ਕੁਦਰਤਿ ਵਸਿਆ ॥
ਤੇਰਾ ਅੰਤੁ ਨ ਜਾਈ ਲਖਿਆ ॥੧॥ ਰਹਾਉ ॥

ਜਾਤਿ ਮਹਿ ਜੋਤਿ ਜੋਤਿ ਮਹਿ ਜਾਤਾ ਅਕਲ ਕਲਾ ਭਰਪੂਰਿ ਰਹਿਆ ॥
ਤੂੰ ਸਚਾ ਸਾਹਿਬੁ ਸਿਫਤਿ ਸੁਆਲ੍ਹ੍ਹਿਉ ਜਿਨਿ ਕੀਤੀ ਸੋ ਪਾਰਿ ਪਇਆ ॥
ਕਹੁ ਨਾਨਕ ਕਰਤੇ ਕੀਆ ਬਾਤਾ ਜੋ ਕਿਛੁ ਕਰਣਾ ਸੁ ਕਰਿ ਰਹਿਆ ॥੨॥

ਸੋ ਦਰੁ ਰਾਗੁ ਆਸਾ ਮਹਲਾ ੧
ੴ ਸਤਿਗੁਰ ਪ੍ਰਸਾਦਿ ॥

ਸੋ ਦਰੁ ਤੇਰਾ ਕੇਹਾ ਸੋ ਘਰੁ ਕੇਹਾ ਜਿਤੁ ਬਹਿ ਸਰਬ ਸਮਾਲੇ ॥
ਵਾਜੇ ਤੇਰੇ ਨਾਦ ਅਨੇਕ ਅਸੰਖਾ ਕੇਤੇ ਤੇਰੇ ਵਾਵਣਹਾਰੇ ॥
ਕੇਤੇ ਤੇਰੇ ਰਾਗ ਪਰੀ ਸਿਉ ਕਹੀਅਹਿ ਕੇਤੇ ਤੇਰੇ ਗਾਵਣਹਾਰੇ ॥
ਗਾਵਨਿ ਤੁਧਨੋ ਪਵਣੁ ਪਾਣੀ ਬੈਸੰਤਰੁ ਗਾਵੈ ਰਾਜਾ ਧਰਮੁ ਦੁਆਰੇ ॥
ਗਾਵਨਿ ਤੁਧਨੋ ਚਿਤੁ ਗੁਪਤੁ ਲਿਖਿ ਜਾਣਨਿ ਲਿਖਿ ਲਿਖਿ ਧਰਮੁ ਬੀਚਾਰੇ ॥

ਗਾਵਨਿ ਤੁਧਨੋ ਈਸਰੁ ਬ੍ਰਹਮਾ ਦੇਵੀ ਸੋਹਨਿ ਤੇਰੇ ਸਦਾ ਸਵਾਰੇ ॥
ਗਾਵਨਿ ਤੁਧਨੋ ਇੰਦ੍ਰ ਇੰਦ੍ਰਾਸਣਿ ਬੈਠੇ ਦੇਵਤਿਆ ਦਰਿ ਨਾਲੇ ॥
ਗਾਵਨਿ ਤੁਧਨੋ ਸਿਧ ਸਮਾਧੀ ਅੰਦਰਿ ਗਾਵਨਿ ਤੁਧਨੋ ਸਾਧ ਬੀਚਾਰੇ ॥
ਗਾਵਨਿ ਤੁਧਨੋ ਜਤੀ ਸਤੀ ਸੰਤੋਖੀ ਗਾਵਨਿ ਤੁਧਨੋ ਵੀਰ ਕਰਾਰੇ ॥
ਗਾਵਨਿ ਤੁਧਨੋ ਪੰਡਿਤ ਪੜਨਿ ਰਖੀਸੁਰ ਜੁਗੁ ਜੁਗੁ ਵੇਦਾ ਨਾਲੇ ॥

ਗਾਵਨਿ ਤੁਧਨੋ ਮੋਹਣੀਆ ਮਨੁ ਮੋਹਨਿ ਸੁਰਗੁ ਮਛੁ ਪਇਆਲੇ ॥
ਗਾਵਨਿ ਤੁਧਨੋ ਰਤਨ ਉਪਾਏ ਤੇਰੇ ਅਠਸਠਿ ਤੀਰਥ ਨਾਲੇ ॥
ਗਾਵਨਿ ਤੁਧਨੋ ਜੋਧ ਮਹਾਬਲ ਸੂਰਾ ਗਾਵਨਿ ਤੁਧਨੋ ਖਾਣੀ ਚਾਰੇ ॥
ਗਾਵਨਿ ਤੁਧਨੋ ਖੰਡ ਮੰਡਲ ਬ੍ਰਹਮੰਡਾ ਕਰਿ ਕਰਿ ਰਖੇ ਤੇਰੇ ਧਾਰੇ ॥

ਸੇਈ ਤੁਧਨੋ ਗਾਵਨਿ ਜੋ ਤੁਧੁ ਭਾਵਨਿ ਰਤੇ ਤੇਰੇ ਭਗਤ ਰਸਾਲੇ ॥
ਹੋਰਿ ਕੇਤੇ ਤੁਧਨੋ ਗਾਵਨਿ ਸੇ ਮੈ ਚਿਤਿ ਨ ਆਵਨਿ ਨਾਨਕੁ ਕਿਆ ਬੀਚਾਰੇ ॥
ਸੋਈ ਸੋਈ ਸਦਾ ਸਚੁ ਸਾਹਿਬੁ ਸਾਚਾ ਸਾਚੀ ਨਾਈ ॥
ਹੈ ਭੀ ਹੋਸੀ ਜਾਇ ਨ ਜਾਸੀ ਰਚਨਾ ਜਿਨਿ ਰਚਾਈ ॥

ਰੰਗੀ ਰੰਗੀ ਭਾਤੀ ਕਰਿ ਕਰਿ ਜਿਨਸੀ ਮਾਇਆ ਜਿਨਿ ਉਪਾਈ ॥
ਕਰਿ ਕਰਿ ਦੇਖੈ ਕੀਤਾ ਆਪਣਾ ਜਿਉ ਤਿਸ ਦੀ ਵਡਿਆਈ ॥
ਜੋ ਤਿਸੁ ਭਾਵੈ ਸੋਈ ਕਰਸੀ ਫਿਰਿ ਹੁਕਮੁ ਨ ਕਰਣਾ ਜਾਈ ॥
ਸੋ ਪਾਤਿਸਾਹੁ ਸਾਹਾ ਪਤਿਸਾਹਿਬੁ ਨਾਨਕ ਰਹਣੁ ਰਜਾਈ ॥੧॥

ਆਸਾ ਮਹਲਾ ੧ ॥
ਸੁਣਿ ਵਡਾ ਆਖੈ ਸਭੁ ਕੋਇ ॥
ਕੇਵਡੁ ਵਡਾ ਡੀਠਾ ਹੋਇ ॥
ਕੀਮਤਿ ਪਾਇ ਨ ਕਹਿਆ ਜਾਇ ॥
ਕਹਣੈ ਵਾਲੇ ਤੇਰੇ ਰਹੇ ਸਮਾਇ ॥੧॥

ਵਡੇ ਮੇਰੇ ਸਾਹਿਬਾ ਗਹਿਰ ਗੰਭੀਰਾ ਗੁਣੀ ਗਹੀਰਾ ॥
ਕੋਇ ਨ ਜਾਣੈ ਤੇਰਾ ਕੇਤਾ ਕੇਵਡੁ ਚੀਰਾ ॥੧॥ ਰਹਾਉ ॥

ਸਭਿ ਸੁਰਤੀ ਮਿਲਿ ਸੁਰਤਿ ਕਮਾਈ ॥
ਸਭ ਕੀਮਤਿ ਮਿਲਿ ਕੀਮਤਿ ਪਾਈ ॥
ਗਿਆਨੀ ਧਿਆਨੀ ਗੁਰ ਗੁਰਹਾਈ ॥
ਕਹਣੁ ਨ ਜਾਈ ਤੇਰੀ ਤਿਲੁ ਵਡਿਆਈ ॥੨॥

ਸਭਿ ਸਤ ਸਭਿ ਤਪ ਸਭਿ ਚੰਗਿਆਈਆ ॥
ਸਿਧਾ ਪੁਰਖਾ ਕੀਆ ਵਡਿਆਈਆ ॥
ਤੁਧੁ ਵਿਣੁ ਸਿਧੀ ਕਿਨੈ ਨ ਪਾਈਆ ॥
ਕਰਮਿ ਮਿਲੈ ਨਾਹੀ ਠਾਕਿ ਰਹਾਈਆ ॥੩॥

ਆਖਣ ਵਾਲਾ ਕਿਆ ਵੇਚਾਰਾ ॥
ਸਿਫਤੀ ਭਰੇ ਤੇਰੇ ਭੰਡਾਰਾ ॥
ਜਿਸੁ ਤੂ ਦੇਹਿ ਤਿਸੈ ਕਿਆ ਚਾਰਾ ॥
ਨਾਨਕ ਸਚੁ ਸਵਾਰਣਹਾਰਾ ॥੪॥੨॥

ਆਸਾ ਮਹਲਾ ੧ ॥
ਆਖਾ ਜੀਵਾ ਵਿਸਰੈ ਮਰਿ ਜਾਉ ॥
ਆਖਣਿ ਅਉਖਾ ਸਾਚਾ ਨਾਉ ॥
ਸਾਚੇ ਨਾਮ ਕੀ ਲਾਗੈ ਭੂਖ ॥
ਉਤੁ ਭੂਖੈ ਖਾਇ ਚਲੀਅਹਿ ਦੂਖ ॥੧॥

ਸੋ ਕਿਉ ਵਿਸਰੈ ਮੇਰੀ ਮਾਇ ॥
ਸਾਚਾ ਸਾਹਿਬੁ ਸਾਚੈ ਨਾਇ ॥੧॥ ਰਹਾਉ ॥

ਸਾਚੇ ਨਾਮ ਕੀ ਤਿਲੁ ਵਡਿਆਈ ॥
ਆਖਿ ਥਕੇ ਕੀਮਤਿ ਨਹੀ ਪਾਈ ॥
ਜੇ ਸਭਿ ਮਿਲਿ ਕੈ ਆਖਣ ਪਾਹਿ ॥
ਵਡਾ ਨ ਹੋਵੈ ਘਾਟਿ ਨ ਜਾਇ ॥੨॥

ਨਾ ਓਹੁ ਮਰੈ ਨ ਹੋਵੈ ਸੋਗੁ ॥
ਦੇਦਾ ਰਹੈ ਨ ਚੂਕੈ ਭੋਗੁ ॥
ਗੁਣੁ ਏਹੋ ਹੋਰੁ ਨਾਹੀ ਕੋਇ ॥
ਨਾ ਕੋ ਹੋਆ ਨਾ ਕੋ ਹੋਇ ॥੩॥

ਜੇਵਡੁ ਆਪਿ ਤੇਵਡ ਤੇਰੀ ਦਾਤਿ ॥
ਜਿਨਿ ਦਿਨੁ ਕਰਿ ਕੈ ਕੀਤੀ ਰਾਤਿ ॥
ਖਸਮੁ ਵਿਸਾਰਹਿ ਤੇ ਕਮਜਾਤਿ ॥
ਨਾਨਕ ਨਾਵੈ ਬਾਝੁ ਸਨਾਤਿ ॥੪॥੩॥

ਰਾਗੁ ਗੂਜਰੀ ਮਹਲਾ ੪ ॥

ਹਰਿ ਕੇ ਜਨ ਸਤਿਗੁਰ ਸਤਪੁਰਖਾ ਬਿਨਉ ਕਰਉ ਗੁਰ ਪਾਸਿ ॥
ਹਮ ਕੀਰੇ ਕਿਰਮ ਸਤਿਗੁਰ ਸਰਣਾਈ ਕਰਿ ਦਇਆ ਨਾਮੁ ਪਰਗਾਸਿ ॥੧॥

ਮੇਰੇ ਮੀਤ ਗੁਰਦੇਵ ਮੋ ਕਉ ਰਾਮ ਨਾਮੁ ਪਰਗਾਸਿ ॥
ਗੁਰਮਤਿ ਨਾਮੁ ਮੇਰਾ ਪ੍ਰਾਨ ਸਖਾਈ ਹਰਿ ਕੀਰਤਿ ਹਮਰੀ ਰਹਰਾਸਿ ॥੧॥ ਰਹਾਉ ॥

ਹਰਿ ਜਨ ਕੇ ਵਡ ਭਾਗ ਵਡੇਰੇ ਜਿਨ ਹਰਿ ਹਰਿ ਸਰਧਾ ਹਰਿ ਪਿਆਸ ॥
ਹਰਿ ਹਰਿ ਨਾਮੁ ਮਿਲੈ ਤ੍ਰਿਪਤਾਸਹਿ ਮਿਲਿ ਸੰਗਤਿ ਗੁਣ ਪਰਗਾਸਿ ॥੨॥

ਜਿਨ ਹਰਿ ਹਰਿ ਹਰਿ ਰਸੁ ਨਾਮੁ ਨ ਪਾਇਆ ਤੇ ਭਾਗਹੀਣ ਜਮ ਪਾਸਿ ॥
ਜੋ ਸਤਿਗੁਰ ਸਰਣਿ ਸੰਗਤਿ ਨਹੀ ਆਏ ਧ੍ਰਿਗੁ ਜੀਵੇ ਧ੍ਰਿਗੁ ਜੀਵਾਸਿ ॥੩॥

ਜਿਨ ਹਰਿ ਜਨ ਸਤਿਗੁਰ ਸੰਗਤਿ ਪਾਈ ਤਿਨ ਧੁਰਿ ਮਸਤਕਿ ਲਿਖਿਆ ਲਿਖਾਸਿ ॥
ਧਨੁ ਧੰਨੁ ਸਤਸੰਗਤਿ ਜਿਤੁ ਹਰਿ ਰਸੁ ਪਾਇਆ ਮਿਲਿ ਜਨ ਨਾਨਕ ਨਾਮੁ ਪਰਗਾਸਿ ॥੪॥੪॥

ਰਾਗੁ ਗੂਜਰੀ ਮਹਲਾ ੫ ॥

ਕਾਹੇ ਰੇ ਮਨ ਚਿਤਵਹਿ ਉਦਮੁ ਜਾ ਆਹਰਿ ਹਰਿ ਜੀਉ ਪਰਿਆ ॥
ਸੈਲ ਪਥਰ ਮਹਿ ਜੰਤ ਉਪਾਏ ਤਾ ਕਾ ਰਿਜਕੁ ਆਗੈ ਕਰਿ ਧਰਿਆ ॥੧॥

ਮੇਰੇ ਮਾਧਉ ਜੀ ਸਤਸੰਗਤਿ ਮਿਲੇ ਸੁ ਤਰਿਆ ॥
ਗੁਰ ਪਰਸਾਦਿ ਪਰਮ ਪਦੁ ਪਾਇਆ ਸੂਕੇ ਕਾਸਟ ਹਰਿਆ ॥੧॥ ਰਹਾਉ ॥

ਜਨਨਿ ਪਿਤਾ ਲੋਕ ਸੁਤ ਬਨਿਤਾ ਕੋਇ ਨ ਕਿਸ ਕੀ ਧਰਿਆ ॥
ਸਿਰਿ ਸਿਰਿ ਰਿਜਕੁ ਸੰਬਾਹੇ ਠਾਕੁਰੁ ਕਾਹੇ ਮਨ ਭਉ ਕਰਿਆ ॥੨॥

ਊਡੇ ਊਡਿ ਆਵੈ ਸੈ ਕੋਸਾ ਤਿਸੁ ਪਾਛੈ ਬਚਰੇ ਛਰਿਆ ॥
ਤਿਨ ਕਵਣੁ ਖਲਾਵੈ ਕਵਣੁ ਚੁਗਾਵੈ ਮਨ ਮਹਿ ਸਿਮਰਨੁ ਕਰਿਆ ॥੩॥

ਸਭਿ ਨਿਧਾਨ ਦਸ ਅਸਟ ਸਿਧਾਨ ਠਾਕੁਰ ਕਰ ਤਲ ਧਰਿਆ ॥
ਜਨ ਨਾਨਕ ਬਲਿ ਬਲਿ ਸਦ ਬਲਿ ਜਾਈਐ ਤੇਰਾ ਅੰਤੁ ਨ ਪਾਰਾਵਰਿਆ ॥੪॥੫॥

ਰਾਗੁ ਆਸਾ ਮਹਲਾ ੪ ਸੋ ਪੁਰਖੁ
ੴ ਸਤਿਗੁਰ ਪ੍ਰਸਾਦਿ ॥

ਸੋ ਪੁਰਖੁ ਨਿਰੰਜਨੁ ਹਰਿ ਪੁਰਖੁ ਨਿਰੰਜਨੁ ਹਰਿ ਅਗਮਾ ਅਗਮ ਅਪਾਰਾ ॥
ਸਭਿ ਧਿਆਵਹਿ ਸਭਿ ਧਿਆਵਹਿ ਤੁਧੁ ਜੀ ਹਰਿ ਸਚੇ ਸਿਰਜਣਹਾਰਾ ॥
ਸਭਿ ਜੀਅ ਤੁਮਾਰੇ ਜੀ ਤੂੰ ਜੀਆ ਕਾ ਦਾਤਾਰਾ ॥
ਹਰਿ ਧਿਆਵਹੁ ਸੰਤਹੁ ਜੀ ਸਭਿ ਦੂਖ ਵਿਸਾਰਣਹਾਰਾ ॥
ਹਰਿ ਆਪੇ ਠਾਕੁਰੁ ਹਰਿ ਆਪੇ ਸੇਵਕੁ ਜੀ ਕਿਆ ਨਾਨਕ ਜੰਤ ਵਿਚਾਰਾ ॥੧॥

ਤੂੰ ਘਟ ਘਟ ਅੰਤਰਿ ਸਰਬ ਨਿਰੰਤਰਿ ਜੀ ਹਰਿ ਏਕੋ ਪੁਰਖੁ ਸਮਾਣਾ ॥
ਇਕਿ ਦਾਤੇ ਇਕਿ ਭੇਖਾਰੀ ਜੀ ਸਭਿ ਤੇਰੇ ਚੋਜ ਵਿਡਾਣਾ ॥
ਤੂੰ ਆਪੇ ਦਾਤਾ ਆਪੇ ਭੁਗਤਾ ਜੀ ਹਉ ਤੁਧੁ ਬਿਨੁ ਅਵਰੁ ਨ ਜਾਣਾ ॥
ਤੂੰ ਪਾਰਬ੍ਰਹਮੁ ਬੇਅੰਤੁ ਬੇਅੰਤੁ ਜੀ ਤੇਰੇ ਕਿਆ ਗੁਣ ਆਖਿ ਵਖਾਣਾ ॥
ਜੋ ਸੇਵਹਿ ਜੋ ਸੇਵਹਿ ਤੁਧੁ ਜੀ ਜਨੁ ਨਾਨਕੁ ਤਿਨ ਕੁਰਬਾਣਾ ॥੨॥

ਹਰਿ ਧਿਆਵਹਿ ਹਰਿ ਧਿਆਵਹਿ ਤੁਧੁ ਜੀ ਸੇ ਜਨ ਜੁਗ ਮਹਿ ਸੁਖਵਾਸੀ ॥
ਸੇ ਮੁਕਤੁ ਸੇ ਮੁਕਤੁ ਭਏ ਜਿਨ ਹਰਿ ਧਿਆਇਆ ਜੀ ਤਿਨ ਤੂਟੀ ਜਮ ਕੀ ਫਾਸੀ ॥
ਜਿਨ ਨਿਰਭਉ ਜਿਨ ਹਰਿ ਨਿਰਭਉ ਧਿਆਇਆ ਜੀ ਤਿਨ ਕਾ ਭਉ ਸਭੁ ਗਵਾਸੀ ॥
ਜਿਨ ਸੇਵਿਆ ਜਿਨ ਸੇਵਿਆ ਮੇਰਾ ਹਰਿ ਜੀ ਤੇ ਹਰਿ ਹਰਿ ਰੂਪਿ ਸਮਾਸੀ ॥
ਸੇ ਧੰਨੁ ਸੇ ਧੰਨੁ ਜਿਨ ਹਰਿ ਧਿਆਇਆ ਜੀ ਜਨੁ ਨਾਨਕੁ ਤਿਨ ਬਲਿ ਜਾਸੀ ॥੩॥

ਤੇਰੀ ਭਗਤਿ ਤੇਰੀ ਭਗਤਿ ਭੰਡਾਰ ਜੀ ਭਰੇ ਬਿਅੰਤ ਬੇਅੰਤਾ ॥
ਤੇਰੇ ਭਗਤ ਤੇਰੇ ਭਗਤ ਸਲਾਹਨਿ ਤੁਧੁ ਜੀ ਹਰਿ ਅਨਿਕ ਅਨੇਕ ਅਨੰਤਾ ॥
ਤੇਰੀ ਅਨਿਕ ਤੇਰੀ ਅਨਿਕ ਕਰਹਿ ਹਰਿ ਪੂਜਾ ਜੀ ਤਪੁ ਤਾਪਹਿ ਜਪਹਿ ਬੇਅੰਤਾ ॥
ਤੇਰੇ ਅਨੇਕ ਤੇਰੇ ਅਨੇਕ ਪੜਹਿ ਬਹੁ ਸਿਮ੍ਰਿਤਿ ਸਾਸਤ ਜੀ ਕਰਿ ਕਿਰਿਆ ਖਟੁ ਕਰਮ ਕਰੰਤਾ ॥
ਸੇ ਭਗਤ ਸੇ ਭਗਤ ਭਲੇ ਜਨ ਨਾਨਕ ਜੀ ਜੋ ਭਾਵਹਿ ਮੇਰੇ ਹਰਿ ਭਗਵੰਤਾ ॥੪॥

ਤੂੰ ਆਦਿ ਪੁਰਖੁ ਅਪਰੰਪਰੁ ਕਰਤਾ ਜੀ ਤੁਧੁ ਜੇਵਡੁ ਅਵਰੁ ਨ ਕੋਈ ॥
ਤੂੰ ਜੁਗੁ ਜੁਗੁ ਏਕੋ ਸਦਾ ਸਦਾ ਤੂੰ ਏਕੋ ਜੀ ਤੂੰ ਨਿਹਚਲੁ ਕਰਤਾ ਸੋਈ ॥
ਤੁਧੁ ਆਪੇ ਭਾਵੈ ਸੋਈ ਵਰਤੈ ਜੀ ਤੂੰ ਆਪੇ ਕਰਹਿ ਸੁ ਹੋਈ ॥
ਤੁਧੁ ਆਪੇ ਸ੍ਰਿਸਟਿ ਸਭ ਉਪਾਈ ਜੀ ਤੁਧੁ ਆਪੇ ਸਿਰਜਿ ਸਭ ਗੋਈ ॥
ਜਨੁ ਨਾਨਕੁ ਗੁਣ ਗਾਵੈ ਕਰਤੇ ਕੇ ਜੀ ਜੋ ਸਭਸੈ ਕਾ ਜਾਣੋਈ ॥੫॥੧॥

ਆਸਾ ਮਹਲਾ ੪ ॥

ਤੂੰ ਕਰਤਾ ਸਚਿਆਰੁ ਮੈਡਾ ਸਾਂਈ ॥
ਜੋ ਤਉ ਭਾਵੈ ਸੋਈ ਥੀਸੀ ਜੋ ਤੂੰ ਦੇਹਿ ਸੋਈ ਹਉ ਪਾਈ ॥੧॥ ਰਹਾਉ ॥

ਸਭ ਤੇਰੀ ਤੂੰ ਸਭਨੀ ਧਿਆਇਆ ॥
ਜਿਸ ਨੋ ਕ੍ਰਿਪਾ ਕਰਹਿ ਤਿਨਿ ਨਾਮ ਰਤਨੁ ਪਾਇਆ ॥
ਗੁਰਮੁਖਿ ਲਾਧਾ ਮਨਮੁਖਿ ਗਵਾਇਆ ॥
ਤੁਧੁ ਆਪਿ ਵਿਛੋੜਿਆ ਆਪਿ ਮਿਲਾਇਆ ॥੧॥

ਤੂੰ ਦਰੀਆਉ ਸਭ ਤੁਝ ਹੀ ਮਾਹਿ ॥
ਤੁਝ ਬਿਨੁ ਦੂਜਾ ਕੋਈ ਨਾਹਿ ॥
ਜੀਅ ਜੰਤ ਸਭਿ ਤੇਰਾ ਖੇਲੁ ॥
ਵਿਜੋਗਿ ਮਿਲਿ ਵਿਛੁੜਿਆ ਸੰਜੋਗੀ ਮੇਲੁ ॥੨॥

ਜਿਸ ਨੋ ਤੂ ਜਾਣਾਇਹਿ ਸੋਈ ਜਨੁ ਜਾਣੈ ॥
ਹਰਿ ਗੁਣ ਸਦ ਹੀ ਆਖਿ ਵਖਾਣੈ ॥
ਜਿਨਿ ਹਰਿ ਸੇਵਿਆ ਤਿਨਿ ਸੁਖੁ ਪਾਇਆ ॥
ਸਹਜੇ ਹੀ ਹਰਿ ਨਾਮਿ ਸਮਾਇਆ ॥੩॥

ਤੂ ਆਪੇ ਕਰਤਾ ਤੇਰਾ ਕੀਆ ਸਭੁ ਹੋਇ ॥
ਤੁਧੁ ਬਿਨੁ ਦੂਜਾ ਅਵਰੁ ਨ ਕੋਇ ॥
ਤੂ ਕਰਿ ਕਰਿ ਵੇਖਹਿ ਜਾਣਹਿ ਸੋਇ ॥
ਜਨ ਨਾਨਕ ਗੁਰਮੁਖਿ ਪਰਗਟੁ ਹੋਇ ॥੪॥੨॥

ਆਸਾ ਮਹਲਾ ੧ ॥

ਤਿਤੁ ਸਰਵਰੜੈ ਭਈਲੇ ਨਿਵਾਸਾ ਪਾਣੀ ਪਾਵਕੁ ਤਿਨਹਿ ਕੀਆ ॥
ਪੰਕਜੁ ਮੋਹ ਪਗੁ ਨਹੀ ਚਾਲੈ ਹਮ ਦੇਖਾ ਤਹ ਡੂਬੀਅਲੇ ॥੧॥

ਮਨ ਏਕੁ ਨ ਚੇਤਸਿ ਮੂੜ ਮਨਾ ॥
ਹਰਿ ਬਿਸਰਤ ਤੇਰੇ ਗੁਣ ਗਲਿਆ ॥੧॥ ਰਹਾਉ ॥

ਨਾ ਹਉ ਜਤੀ ਸਤੀ ਨਹੀ ਪੜਿਆ ਮੂਰਖ ਮੁਗਧਾ ਜਨਮੁ ਭਇਆ ॥
ਪ੍ਰਣਵਤਿ ਨਾਨਕ ਤਿਨ ਕੀ ਸਰਣਾ ਜਿਨ ਤੂ ਨਾਹੀ ਵੀਸਰਿਆ ॥੨॥੩॥

ਆਸਾ ਮਹਲਾ ੫ ॥

ਭਈ ਪਰਾਪਤਿ ਮਾਨੁਖ ਦੇਹੁਰੀਆ ॥
ਗੋਬਿੰਦ ਮਿਲਣ ਕੀ ਇਹ ਤੇਰੀ ਬਰੀਆ ॥
ਅਵਰਿ ਕਾਜ ਤੇਰੈ ਕਿਤੈ ਨ ਕਾਮ ॥
ਮਿਲੁ ਸਾਧਸੰਗਤਿ ਭਜੁ ਕੇਵਲ ਨਾਮ ॥੧॥

ਸਰੰਜਾਮਿ ਲਾਗੁ ਭਵਜਲ ਤਰਨ ਕੈ ॥
ਜਨਮੁ ਬ੍ਰਿਥਾ ਜਾਤ ਰੰਗਿ ਮਾਇਆ ਕੈ ॥੧॥ ਰਹਾਉ ॥

ਜਪੁ ਤਪੁ ਸੰਜਮੁ ਧਰਮੁ ਨ ਕਮਾਇਆ ॥
ਸੇਵਾ ਸਾਧ ਨ ਜਾਨਿਆ ਹਰਿ ਰਾਇਆ ॥
ਕਹੁ ਨਾਨਕ ਹਮ ਨੀਚ ਕਰੰਮਾ ॥
ਸਰਣਿ ਪਰੇ ਕੀ ਰਾਖਹੁ ਸਰਮਾ ॥੨॥੪॥

ਕਬ੍ਯੋ ਬਾਚ ਬੇਨਤੀ ॥

ਚੌਪਈ ॥

ਹਮਰੀ ਕਰੋ ਹਾਥ ਦੈ ਰਛਾ ॥
ਪੂਰਨ ਹੋਇ ਚਿਤ ਕੀ ਇਛਾ ॥
ਤਵ ਚਰਨਨ ਮਨ ਰਹੈ ਹਮਾਰਾ ॥
ਅਪਨਾ ਜਾਨ ਕਰੋ ਪ੍ਰਤਿਪਾਰਾ ॥੩੭੭॥

ਹਮਰੇ ਦੁਸਟ ਸਭੈ ਤੁਮ ਘਾਵਹੁ ॥
ਆਪੁ ਹਾਥ ਦੈ ਮੋਹਿ ਬਚਾਵਹੁ ॥
ਸੁਖੀ ਬਸੈ ਮੋਰੋ ਪਰਿਵਾਰਾ ॥
ਸੇਵਕ ਸਿਖ੍ਯ ਸਭੈ ਕਰਤਾਰਾ ॥੩੭੮॥

ਮੋ ਰਛਾ ਨਿਜੁ ਕਰ ਦੈ ਕਰਿਯੈ ॥
ਸਭ ਬੈਰਿਨ ਕੌ ਆਜ ਸੰਘਰਿਯੈ ॥
ਪੂਰਨ ਹੋਇ ਹਮਾਰੀ ਆਸਾ ॥
ਤੋਰਿ ਭਜਨ ਕੀ ਰਹੈ ਪਿਯਾਸਾ ॥੩੭੯॥

ਤੁਮਹਿ ਛਾਡਿ ਕੋਈ ਅਵਰ ਨ ਧ੍ਯਾਊ ॥
ਜੋ ਬਰ ਚਾਹੌ ਸੁ ਤੁਮ ਤੇ ਪਾਊ ॥
ਸੇਵਕ ਸਿਖ੍ਯ ਹਮਾਰੇ ਤਾਰਿਯਹਿ ॥
ਚੁਨ ਚੁਨ ਸਤ੍ਰੁ ਹਮਾਰੇ ਮਾਰਿਯਹਿ ॥੩੮੦॥

ਆਪੁ ਹਾਥ ਦੈ ਮੁਝੈ ਉਬਰਿਯੈ ॥
ਮਰਨ ਕਾਲ ਕਾ ਤ੍ਰਾਸ ਨਿਵਰਿਯੈ ॥
ਹੂਜੋ ਸਦਾ ਹਮਾਰੇ ਪਛਾ ॥
ਸ੍ਰੀ ਅਸਿਧੁਜ ਜੂ ਕਰਿਯਹੁ ਰਛਾ ॥੩੮੧॥

ਰਾਖਿ ਲੇਹੁ ਮੁਹਿ ਰਾਖਨਹਾਰੇ ॥
ਸਾਹਿਬ ਸੰਤ ਸਹਾਇ ਪਿਯਾਰੇ ॥
ਦੀਨਬੰਧੁ ਦੁਸਟਨ ਕੇ ਹੰਤਾ ॥
ਤੁਮ ਹੋ ਪੁਰੀ ਚਤੁਰਦਸ ਕੰਤਾ ॥੩੮੨॥

ਕਾਲ ਪਾਇ ਬ੍ਰਹਮਾ ਬਪੁ ਧਰਾ ॥
ਕਾਲ ਪਾਇ ਸਿਵ ਜੂ ਅਵਤਰਾ ॥
ਕਾਲ ਪਾਇ ਕਰਿ ਬਿਸਨ ਪ੍ਰਕਾਸਾ ॥
ਸਕਲ ਕਾਲ ਕਾ ਕੀਯਾ ਤਮਾਸਾ ॥੩੮੩॥

ਜਵਨ ਕਾਲ ਜੋਗੀ ਸਿਵ ਕੀਯੋ ॥
ਬੇਦ ਰਾਜ ਬ੍ਰਹਮਾ ਜੂ ਥੀਯੋ ॥
ਜਵਨ ਕਾਲ ਸਭ ਲੋਕ ਸਵਾਰਾ ॥
ਨਮਸਕਾਰ ਹੈ ਤਾਹਿ ਹਮਾਰਾ ॥੩੮੪॥

ਜਵਨ ਕਾਲ ਸਭ ਜਗਤ ਬਨਾਯੋ ॥
ਦੇਵ ਦੈਤ ਜਛਨ ਉਪਜਾਯੋ ॥
ਆਦਿ ਅੰਤਿ ਏਕੈ ਅਵਤਾਰਾ ॥
ਸੋਈ ਗੁਰੂ ਸਮਝਿਯਹੁ ਹਮਾਰਾ ॥੩੮੫॥

ਨਮਸਕਾਰ ਤਿਸ ਹੀ ਕੋ ਹਮਾਰੀ ॥
ਸਕਲ ਪ੍ਰਜਾ ਜਿਨ ਆਪ ਸਵਾਰੀ ॥
ਸਿਵਕਨ ਕੋ ਸਿਵਗੁਨ ਸੁਖ ਦੀਯੋ ॥
ਸਤ੍ਰੁਨ ਕੋ ਪਲ ਮੋ ਬਧ ਕੀਯੋ ॥੩੮੬॥

ਘਟ ਘਟ ਕੇ ਅੰਤਰ ਕੀ ਜਾਨਤ ॥
ਭਲੇ ਬੁਰੇ ਕੀ ਪੀਰ ਪਛਾਨਤ ॥
ਚੀਟੀ ਤੇ ਕੁੰਚਰ ਅਸਥੂਲਾ ॥
ਸਭ ਪਰ ਕ੍ਰਿਪਾ ਦ੍ਰਿਸਟਿ ਕਰਿ ਫੂਲਾ ॥੩੮੭॥

ਸੰਤਨ ਦੁਖ ਪਾਏ ਤੇ ਦੁਖੀ ॥
ਸੁਖ ਪਾਏ ਸਾਧਨ ਕੇ ਸੁਖੀ ॥
ਏਕ ਏਕ ਕੀ ਪੀਰ ਪਛਾਨੈ ॥
ਘਟ ਘਟ ਕੇ ਪਟ ਪਟ ਕੀ ਜਾਨੈ ॥੩੮੮॥

ਜਬ ਉਦਕਰਖ ਕਰਾ ਕਰਤਾਰਾ ॥
ਪ੍ਰਜਾ ਧਰਤ ਤਬ ਦੇਹ ਅਪਾਰਾ ॥
ਜਬ ਆਕਰਖ ਕਰਤ ਹੋ ਕਬਹੂੰ ॥
ਤੁਮ ਮੈ ਮਿਲਤ ਦੇਹ ਧਰ ਸਭਹੂੰ ॥੩੮੯॥

ਜੇਤੇ ਬਦਨ ਸ੍ਰਿਸਟਿ ਸਭ ਧਾਰੈ ॥
ਆਪੁ ਆਪੁਨੀ ਬੂਝਿ ਉਚਾਰੈ ॥
ਤੁਮ ਸਭ ਹੀ ਤੇ ਰਹਤ ਨਿਰਾਲਮ ॥
ਜਾਨਤ ਬੇਦ ਭੇਦ ਅਰੁ ਆਲਮ ॥੩੯੦॥

ਨਿਰੰਕਾਰ ਨ੍ਰਿਬਿਕਾਰ ਨ੍ਰਿਲੰਭ ॥
ਆਦਿ ਅਨੀਲ ਅਨਾਦਿ ਅਸੰਭ ॥
ਤਾ ਕਾ ਮੂੜ ਉਚਾਰਤ ਭੇਦਾ ॥
ਜਾ ਕੋ ਭੇਵ ਨ ਪਾਵਤ ਬੇਦਾ ॥੩੯੧॥

ਤਾ ਕੌ ਕਰਿ ਪਾਹਨ ਅਨੁਮਾਨਤ ॥
ਮਹਾ ਮੂੜ ਕਛੁ ਭੇਦ ਨ ਜਾਨਤ ॥
ਮਹਾਦੇਵ ਕੌ ਕਹਤ ਸਦਾ ਸਿਵ ॥
ਨਿਰੰਕਾਰ ਕਾ ਚੀਨਤ ਨਹਿ ਭਿਵ ॥੩੯੨॥

ਆਪੁ ਆਪੁਨੀ ਬੁਧਿ ਹੈ ਜੇਤੀ ॥
ਬਰਨਤ ਭਿੰਨ ਭਿੰਨ ਤੁਹਿ ਤੇਤੀ ॥
ਤੁਮਰਾ ਲਖਾ ਨ ਜਾਇ ਪਸਾਰਾ ॥
ਕਿਹ ਬਿਧਿ ਸਜਾ ਪ੍ਰਥਮ ਸੰਸਾਰਾ ॥੩੯੩॥

ਏਕੈ ਰੂਪ ਅਨੂਪ ਸਰੂਪਾ ॥
ਰੰਕ ਭਯੋ ਰਾਵ ਕਹੀ ਭੂਪਾ ॥
ਅੰਡਜ ਜੇਰਜ ਸੇਤਜ ਕੀਨੀ ॥
ਉਤਭੁਜ ਖਾਨਿ ਬਹੁਰਿ ਰਚਿ ਦੀਨੀ ॥੩੯੪॥

ਕਹੂੰ ਫੂਲਿ ਰਾਜਾ ਹ੍ਵੈ ਬੈਠਾ ॥
ਕਹੂੰ ਸਿਮਟਿ ਭਯੋ ਸੰਕਰ ਇਕੈਠਾ ॥
ਸਗਰੀ ਸ੍ਰਿਸਟਿ ਦਿਖਾਇ ਅਚੰਭਵ ॥
ਆਦਿ ਜੁਗਾਦਿ ਸਰੂਪ ਸੁਯੰਭਵ ॥੩੯੫॥

ਅਬ ਰਛਾ ਮੇਰੀ ਤੁਮ ਕਰੋ ॥
ਸਿਖ੍ਯ ਉਬਾਰਿ ਅਸਿਖ੍ਯ ਸੰਘਰੋ ॥
ਦੁਸਟ ਜਿਤੇ ਉਠਵਤ ਉਤਪਾਤਾ ॥
ਸਕਲ ਮਲੇਛ ਕਰੋ ਰਣ ਘਾਤਾ ॥੩੯੬॥

ਜੇ ਅਸਿਧੁਜ ਤਵ ਸਰਨੀ ਪਰੇ ॥
ਤਿਨ ਕੇ ਦੁਸਟ ਦੁਖਿਤ ਹ੍ਵੈ ਮਰੇ ॥
ਪੁਰਖ ਜਵਨ ਪਗੁ ਪਰੇ ਤਿਹਾਰੇ ॥
ਤਿਨ ਕੇ ਤੁਮ ਸੰਕਟ ਸਭ ਟਾਰੇ ॥੩੯੭॥

ਜੋ ਕਲਿ ਕੌ ਇਕ ਬਾਰ ਧਿਐਹੈ ॥
ਤਾ ਕੇ ਕਾਲ ਨਿਕਟਿ ਨਹਿ ਐਹੈ ॥
ਰਛਾ ਹੋਇ ਤਾਹਿ ਸਭ ਕਾਲਾ ॥
ਦੁਸਟ ਅਰਿਸਟ ਟਰੈਂ ਤਤਕਾਲਾ ॥੩੯੮॥

ਕ੍ਰਿਪਾ ਦ੍ਰਿਸਟਿ ਤਨ ਜਾਹਿ ਨਿਹਰਿਹੋ ॥
ਤਾ ਕੇ ਤਾਪ ਤਨਕ ਮਹਿ ਹਰਿਹੋ ॥
ਰਿਧਿ ਸਿਧਿ ਘਰ ਮੋ ਸਭ ਹੋਈ ॥
ਦੁਸਟ ਛਾਹ ਛ੍ਵੈ ਸਕੈ ਨ ਕੋਈ ॥੩੯੯॥

ਏਕ ਬਾਰ ਜਿਨ ਤੁਮੈ ਸੰਭਾਰਾ ॥
ਕਾਲ ਫਾਸ ਤੇ ਤਾਹਿ ਉਬਾਰਾ ॥
ਜਿਨ ਨਰ ਨਾਮ ਤਿਹਾਰੋ ਕਹਾ ॥
ਦਾਰਿਦ ਦੁਸਟ ਦੋਖ ਤੇ ਰਹਾ ॥੪੦੦॥

ਖੜਗਕੇਤੁ ਮੈ ਸਰਨਿ ਤਿਹਾਰੀ ॥
ਆਪੁ ਹਾਥ ਦੈ ਲੇਹੁ ਉਬਾਰੀ ॥
ਸਰਬ ਠੌਰ ਮੋ ਹੋਹੁ ਸਹਾਈ ॥
ਦੁਸਟ ਦੋਖ ਤੇ ਲੇਹੁ ਬਚਾਈ ॥੪੦੧॥

ਸ੍ਵੈਯਾ ॥

ਪਾਂਇ ਗਹੇ ਜਬ ਤੇ ਤੁਮਰੇ ਤਬ ਤੇ ਕੋਊ ਆਂਖ ਤਰੇ ਨਹੀ ਆਨਯੋ ॥
ਰਾਮ ਰਹੀਮ ਪੁਰਾਨ ਕੁਰਾਨ ਅਨੇਕ ਕਹੈਂ ਮਤ ਏਕ ਨ ਮਾਨਯੋ ॥
ਸਿੰਮ੍ਰਿਤਿ ਸਾਸਤ੍ਰ ਬੇਦ ਸਭੈ ਬਹੁ ਭੇਦ ਕਹੈ ਹਮ ਏਕ ਨ ਜਾਨਯੋ ॥
ਸ੍ਰੀ ਅਸਿਪਾਨ ਕ੍ਰਿਪਾ ਤੁਮਰੀ ਕਰਿ ਮੈ ਨ ਕਹਯੋ ਸਭ ਤੋਹਿ ਬਖਾਨਯੋ ॥੮੬੩॥

ਦੋਹਰਾ ॥

ਸਗਲ ਦੁਆਰ ਕਉ ਛਾਡਿ ਕੈ ਗਹਯੋ ਤੁਹਾਰੋ ਦੁਆਰ ॥
ਬਾਂਹਿ ਗਹੇ ਕੀ ਲਾਜ ਅਸਿ ਗੋਬਿੰਦ ਦਾਸ ਤੁਹਾਰ ॥੮੬੪॥

ਰਾਮਕਲੀ ਮਹਲਾ ੩ ਅਨੰਦੁ
ੴ ਸਤਿਗੁਰ ਪ੍ਰਸਾਦਿ ॥

ਅਨੰਦੁ ਭਇਆ ਮੇਰੀ ਮਾਏ ਸਤਿਗੁਰੂ ਮੈ ਪਾਇਆ ॥
ਸਤਿਗੁਰੁ ਤ ਪਾਇਆ ਸਹਜ ਸੇਤੀ ਮਨਿ ਵਜੀਆ ਵਾਧਾਈਆ ॥
ਰਾਗ ਰਤਨ ਪਰਵਾਰ ਪਰੀਆ ਸਬਦ ਗਾਵਣ ਆਈਆ ॥
ਸਬਦੋ ਤ ਗਾਵਹੁ ਹਰੀ ਕੇਰਾ ਮਨਿ ਜਿਨੀ ਵਸਾਇਆ ॥
ਕਹੈ ਨਾਨਕੁ ਅਨੰਦੁ ਹੋਆ ਸਤਿਗੁਰੂ ਮੈ ਪਾਇਆ ॥੧॥

ਏ ਮਨ ਮੇਰਿਆ ਤੂ ਸਦਾ ਰਹੁ ਹਰਿ ਨਾਲੇ ॥
ਹਰਿ ਨਾਲਿ ਰਹੁ ਤੂ ਮੰਨ ਮੇਰੇ ਦੂਖ ਸਭਿ ਵਿਸਾਰਣਾ ॥
ਅੰਗੀਕਾਰੁ ਓਹੁ ਕਰੇ ਤੇਰਾ ਕਾਰਜ ਸਭਿ ਸਵਾਰਣਾ ॥
ਸਭਨਾ ਗਲਾ ਸਮਰਥੁ ਸੁਆਮੀ ਸੋ ਕਿਉ ਮਨਹੁ ਵਿਸਾਰੇ ॥
ਕਹੈ ਨਾਨਕੁ ਮੰਨ ਮੇਰੇ ਸਦਾ ਰਹੁ ਹਰਿ ਨਾਲੇ ॥੨॥

ਸਾਚੇ ਸਾਹਿਬਾ ਕਿਆ ਨਾਹੀ ਘਰਿ ਤੇਰੈ ॥
ਘਰਿ ਤ ਤੇਰੈ ਸਭੁ ਕਿਛੁ ਹੈ ਜਿਸੁ ਦੇਹਿ ਸੁ ਪਾਵਏ ॥
ਸਦਾ ਸਿਫਤਿ ਸਲਾਹ ਤੇਰੀ ਨਾਮੁ ਮਨਿ ਵਸਾਵਏ ॥
ਨਾਮੁ ਜਿਨ ਕੈ ਮਨਿ ਵਸਿਆ ਵਾਜੇ ਸਬਦ ਘਨੇਰੇ ॥
ਕਹੈ ਨਾਨਕੁ ਸਚੇ ਸਾਹਿਬ ਕਿਆ ਨਾਹੀ ਘਰਿ ਤੇਰੈ ॥੩॥

ਸਾਚਾ ਨਾਮੁ ਮੇਰਾ ਆਧਾਰੋ ॥
ਸਾਚੁ ਨਾਮੁ ਅਧਾਰੁ ਮੇਰਾ ਜਿਨਿ ਭੁਖਾ ਸਭਿ ਗਵਾਈਆ ॥
ਕਰਿ ਸਾਂਤਿ ਸੁਖ ਮਨਿ ਆਇ ਵਸਿਆ ਜਿਨਿ ਇਛਾ ਸਭਿ ਪੁਜਾਈਆ ॥
ਸਦਾ ਕੁਰਬਾਣੁ ਕੀਤਾ ਗੁਰੂ ਵਿਟਹੁ ਜਿਸ ਦੀਆ ਏਹਿ ਵਡਿਆਈਆ ॥
ਕਹੈ ਨਾਨਕੁ ਸੁਣਹੁ ਸੰਤਹੁ ਸਬਦਿ ਧਰਹੁ ਪਿਆਰੋ ॥
ਸਾਚਾ ਨਾਮੁ ਮੇਰਾ ਆਧਾਰੋ ॥੪॥

ਵਾਜੇ ਪੰਚ ਸਬਦ ਤਿਤੁ ਘਰਿ ਸਭਾਗੈ ॥
ਘਰਿ ਸਭਾਗੈ ਸਬਦ ਵਾਜੇ ਕਲਾ ਜਿਤੁ ਘਰਿ ਧਾਰੀਆ ॥
ਪੰਚ ਦੂਤ ਤੁਧੁ ਵਸਿ ਕੀਤੇ ਕਾਲੁ ਕੰਟਕੁ ਮਾਰਿਆ ॥
ਧੁਰਿ ਕਰਮਿ ਪਾਇਆ ਤੁਧੁ ਜਿਨ ਕਉ ਸਿ ਨਾਮਿ ਹਰਿ ਕੈ ਲਾਗੇ ॥
ਕਹੈ ਨਾਨਕੁ ਤਹ ਸੁਖੁ ਹੋਆ ਤਿਤੁ ਘਰਿ ਅਨਹਦ ਵਾਜੇ ॥੫॥

ਅਨਦੁ ਸੁਣਹੁ ਵਡਭਾਗੀਹੋ ਸਗਲ ਮਨੋਰਥ ਪੂਰੇ ॥
ਪਾਰਬ੍ਰਹਮੁ ਪ੍ਰਭੁ ਪਾਇਆ ਉਤਰੇ ਸਗਲ ਵਿਸੂਰੇ ॥
ਦੂਖ ਰੋਗ ਸੰਤਾਪ ਉਤਰੇ ਸੁਣੀ ਸਚੀ ਬਾਣੀ ॥
ਸੰਤ ਸਾਜਨ ਭਏ ਸਰਸੇ ਪੂਰੇ ਗੁਰ ਤੇ ਜਾਣੀ ॥
ਸੁਣਤੇ ਪੁਨੀਤ ਕਹਤੇ ਪਵਿਤੁ ਸਤਿਗੁਰੁ ਰਹਿਆ ਭਰਪੂਰੇ ॥
ਬਿਨਵੰਤਿ ਨਾਨਕੁ ਗੁਰ ਚਰਣ ਲਾਗੇ ਵਾਜੇ ਅਨਹਦ ਤੂਰੇ ॥੪੦॥੧॥

ਮੁੰਦਾਵਣੀ ਮਹਲਾ ੫ ॥

ਥਾਲ ਵਿਚਿ ਤਿੰਨਿ ਵਸਤੂ ਪਈਓ ਸਤੁ ਸੰਤੋਖੁ ਵੀਚਾਰੋ ॥
ਅੰਮ੍ਰਿਤ ਨਾਮੁ ਠਾਕੁਰ ਕਾ ਪਇਓ ਜਿਸ ਕਾ ਸਭਸੁ ਅਧਾਰੋ ॥
ਜੇ ਕੋ ਖਾਵੈ ਜੇ ਕੋ ਭੁੰਚੈ ਤਿਸ ਕਾ ਹੋਇ ਉਧਾਰੋ ॥
ਏਹ ਵਸਤੁ ਤਜੀ ਨਹ ਜਾਈ ਨਿਤ ਨਿਤ ਰਖੁ ਉਰਿ ਧਾਰੋ ॥
ਤਮ ਸੰਸਾਰੁ ਚਰਨ ਲਗਿ ਤਰੀਐ ਸਭੁ ਨਾਨਕ ਬ੍ਰਹਮ ਪਸਾਰੋ ॥੧॥

ਸਲੋਕ ਮਹਲਾ ੫ ॥

ਤੇਰਾ ਕੀਤਾ ਜਾਤੋ ਨਾਹੀ ਮੈਨੋ ਜੋਗੁ ਕੀਤੋਈ ॥
ਮੈ ਨਿਰਗੁਣਿਆਰੇ ਕੋ ਗੁਣੁ ਨਾਹੀ ਆਪੇ ਤਰਸੁ ਪਇਓਈ ॥
ਤਰਸੁ ਪਇਆ ਮਿਹਰਾਮਤਿ ਹੋਈ ਸਤਿਗੁਰੁ ਸਜਣੁ ਮਿਲਿਆ ॥
ਨਾਨਕ ਨਾਮੁ ਮਿਲੈ ਤਾਂ ਜੀਵਾਂ ਤਨੁ ਮਨੁ ਥੀਵੈ ਹਰਿਆ ॥੧॥

ਪਉੜੀ ॥

ਤਿਥੈ ਤੂ ਸਮਰਥੁ ਜਿਥੈ ਕੋਇ ਨਾਹਿ ॥
ਓਥੈ ਤੇਰੀ ਰਖ ਅਗਨੀ ਉਦਰ ਮਾਹਿ ॥
ਸੁਣਿ ਕੈ ਜਮ ਕੇ ਦੂਤ ਨਾਇ ਤੇਰੈ ਛਡਿ ਜਾਹਿ ॥
ਭਉਜਲੁ ਬਿਖਮੁ ਅਸਗਾਹੁ ਗੁਰ ਸਬਦੀ ਪਾਰਿ ਪਾਹਿ ॥
ਜਿਨ ਕਉ ਲਗੀ ਪਿਆਸ ਅੰਮ੍ਰਿਤੁ ਸੇਇ ਖਾਹਿ ॥
ਕਲਿ ਮਹਿ ਏਹੋ ਪੁੰਨੁ ਗੁਣ ਗੋਵਿੰਦ ਗਾਹਿ ॥
ਸਭਸੈ ਨੋ ਕਿਰਪਾਲੁ ਸਮ੍ਹ੍ਹਾਲੇ ਸਾਹਿ ਸਾਹਿ ॥
ਬਿਰਥਾ ਕੋਇ ਨ ਜਾਇ ਜਿ ਆਵੈ ਤੁਧੁ ਆਹਿ ॥੯॥

ਰਾਗੁ ਗੂਜਰੀ ਵਾਰ ਮਹਲਾ ੫
ੴ ਸਤਿਗੁਰ ਪ੍ਰਸਾਦਿ ॥
ਸਲੋਕੁ ਮਃ ੫ ॥

ਅੰਤਰਿ ਗੁਰੁ ਆਰਾਧਣਾ ਜਿਹਵਾ ਜਪਿ ਗੁਰ ਨਾਉ ॥
ਨੇਤ੍ਰੀ ਸਤਿਗੁਰੁ ਪੇਖਣਾ ਸ੍ਰਵਣੀ ਸੁਨਣਾ ਗੁਰ ਨਾਉ ॥
ਸਤਿਗੁਰ ਸੇਤੀ ਰਤਿਆ ਦਰਗਹ ਪਾਈਐ ਠਾਉ ॥
ਕਹੁ ਨਾਨਕ ਕਿਰਪਾ ਕਰੇ ਜਿਸ ਨੋ ਏਹ ਵਥੁ ਦੇਇ ॥
ਜਗ ਮਹਿ ਉਤਮ ਕਾਢੀਅਹਿ ਵਿਰਲੇ ਕੇਈ ਕੇਇ ॥੧॥

ਮਃ ੫ ॥

ਰਖੇ ਰਖਣਹਾਰਿ ਆਪਿ ਉਬਾਰਿਅਨੁ ॥
ਗੁਰ ਕੀ ਪੈਰੀ ਪਾਇ ਕਾਜ ਸਵਾਰਿਅਨੁ ॥
ਹੋਆ ਆਪਿ ਦਇਆਲੁ ਮਨਹੁ ਨ ਵਿਸਾਰਿਅਨੁ ॥
ਸਾਧ ਜਨਾ ਕੈ ਸੰਗਿ ਭਵਜਲੁ ਤਾਰਿਅਨੁ ॥
ਸਾਕਤ ਨਿੰਦਕ ਦੁਸਟ ਖਿਨ ਮਾਹਿ ਬਿਦਾਰਿਅਨੁ ॥
ਤਿਸੁ ਸਾਹਿਬ ਕੀ ਟੇਕ ਨਾਨਕ ਮਨੈ ਮਾਹਿ ॥
ਜਿਸੁ ਸਿਮਰਤ ਸੁਖੁ ਹੋਇ ਸਗਲੇ ਦੂਖ ਜਾਹਿ ॥੨॥


ਵਾਹਿਗੁਰੂ ਜੀ ਕਾ ਖਾਲਸਾ, ਵਾਹਿਗੁਰੂ ਜੀ ਕੀ ਫ਼ਤਿਹ!
""",
};
